{"Id":"19610","ProductId":"B000084ETV","UserId":"A3FY6Y2VE7AWYJ","ProfileName":"Ude257 \"I heart bargains!\"","HelpfulnessNumerator":2,"HelpfulnessDenominator":2,"Score":5,"date":"2011-08-23","Summary":"I have a brand new dog!!","Text":"Oh my goodness...I have an 11 year old pug/beagle mix that has been lethargic for about 3 years, wouldn't really play, had a dull coat no matter how much I groomed her, and has had itchy paws and armpits for a long time. I never knew that all of that crap was in the big name brand dog foods. I had always had her on Purina of some sort until I started doing research. I was blown away by what I read and quickly became obsessed with finding a better food without paying an arm and a leg. I refuse to pay more for my dogs food than for our own food. After researching about 30 different dog foods and prices and brands on different websites, I went with Canidae All Life Stages (chicken, turkey, lamb, and fish)via Amazon with free super saver shipping for both my 11 year old Puggle and my new 10 week old labrador retriever puppy. I haven't regretted the change or the purchase at all! I am absolutely thrilled. My 11 year old isn't nearly as itchy, has a crazy shiny coat now, and has ALL KINDS of energy to keep up with the puppy now! Also, the breeder of my new lab had her on Purina Pro Plan Large Breed so I switched her right away and even her coat looks so much better now and it's only been about 3 weeks. I can't wait to see the difference in the two of them over the next 3 or 4 months. They both did get a little bit constipated during the transition period from their old foods to the Canidae, but a little bit of canola oil for a few days drizzled over their breakfast and dinner fixed that until their bodies adjusted. Both are regular now with no problems. Also, during the transition, I couldn't get either of them to eat even one piece of their old food. They would both pick out the Canidae and gobble it up and then leave their old food in the bowl until they were later famished! It was funny to watch!  Great product, great service, and will definitely continue to order the 44 lb bag via Amazon. The packaging was very very poor but that's a different issue. The box that the food was shipped in wasn't even big enough for the bag and the UPS driver brought me the food, with pieces of the box laying on top of the bag. Oh well, I'm still thrilled with the product!<br /><br />UPDATE:  SEVERAL MONTHS LATER, BOTH DOGS ARE STILL DOING FANTASTIC WITH THE CANIDAE FOOD! THE PUPPY'S COAT ACTUALLY SPARKLES LIKE I PUT GLITTER ON HER IN THE SUNLIGHT, IT'S CRAZY. THE PUGGLE IS ONLY SHEDDING A THIRD OF WHAT SHE USED TO AND THE ONLY THING THAT SHE EVER CHEWS ON IS ONE OF HER PAWS AND THE VET GAVE ME A SPRAY FOR THAT. I AM STILL THRILLED WITH THE FOOD AND WITH AMAZON'S PRICE AND THE FREE SHIPPING!"}
