{"Id":"5040","ProductId":"B0026RHUP8","UserId":"A291TCX4BEY4JA","ProfileName":"Cedar","HelpfulnessNumerator":"22","HelpfulnessDenominator":"24","Score":"5","date":"2009-12-29","Summary":"My Family's #1 Formula","Text":"Enfamil Premium Lipil Formula is the same as the previous flagship Mead Johnson formula--Enfamil Lipil--except that it has \"prebiotics\" added in.  Our son was on Enfamil Lipil from September 2007-September 2008.  He was breastfed and formula fed during this time.  Our daughter, who is due in January 2010, will also be breastfed and formula fed for her first year of life.  We tried two other formulas with our son--Similac Advance and Parent's Choice.  The Similac was fine but clumped badly.  During the time we experimented with the Parent's Choice formula, my son was consistently troubled by colds and the flu.  I think the Parent's Choice formula lowered his immunity somehow and will never use it again.  I believe that Mead Johnson's decision to use prebiotics is a good one.  Our son had colic/acid reflux in part because his digestive system was not yet populated with the good bacteria for breaking down milk proteins.  He was a lot more comfortable after we started putting a little Culturelle (a probiotic) in his formula in the evening.  And since a lot of our immune system is in our digestive tract, he had fewer sick days after introducing the Culturelle.  Probiotics and prebiotics will also help infants rebound from the negative effects of antibiotics like amoxicillin quicker.<br /><br />Regarding the bpa found in formula can liners, I talked to an Enfamil customer service representative who told me that Mead Johnson now uses cans that are lined with a \"modified polyester\" that is bpa free.  Similac Advance Earlyshield comes in a bpa-free can also (the SimplePac container).<br /><br />Another concern parents have is the cost of formula.  Name brand formulas are expensive!  But if you think about it, you are feeding a human being for about $15 a week (a can usually lasts us 1.5 to 2 weeks).  $15 a week is peanuts compared to what a hungry teenager devours!  And with name brand formulas you are getting the absolute best product available--Bill Gates couldn't buy a better formula than what's on the shelves at Target or Wal-mart.<br /><br />If you are a new parent and feel overwhelmed by the infant formula section of your grocery store (as I was in September 2007), I suggest starting with the flagship formula of either Mead Johnson (Enfamil Premium Lipil), Abbott Laboratories (Similac Advance Earlyshield), or Nestle (Good Start Gentle Plus or Good Start Protect Plus).  They are all excellent infant formulas.  You just have to see what works for you and your baby."}
