{"Id":"240074","ProductId":"B001VJ0B0I","UserId":"A1MKPMJPD22YY","ProfileName":"S. Cline \"Retired Fed\"","HelpfulnessNumerator":2,"HelpfulnessDenominator":3,"Score":5,"date":"2012-07-25","Summary":"LOL!!!!!!!!! My CATS are fighting over this one - they believe it's their food!","text":"Poor Doggie, all he can do is sit there, watch, and whimper the moment I opened this bag; immediately my 2 Cats came running over. I am babysitting a Dog while the neighbor is in the Nursing Home in Therapy. It was totally unreal! The cats were literally fighting over it, while I have a 20 year old and a 6 year old which left me scratching my head. They never had any interest in dog food before, but my heart was going out as my neighbor will be transferred to a different facility for more therapy before he returns back home and his wife isn't able to handle him (their dog) as they are elderly. I knew their dog was overweight and been working on putting him back in shape. I had to feed him somewhere else but it didn't take long for the younger cat to find where the food was until having to put the dog, food, and water in the bathroom. Under observation, he just literally snarfed it up in a glup and tried to rip the bag open for more! He loved it; I gave him 4 cups already, so provided him only one half cup (*POOF - GONE*), already smacking, licking, and arfing with begging for more. Had to put the bag in the back room. Right now, he's been sitting in the back room as he knows where his food is along with his food bowl as if somehow the food is going to \"magically\" fill his food bowl up. I cannot express how fast he downed that food; in comparison to his regular Vet recommended \"Top of the Line\" Brand name food which he often doesn't finish.  10 paws up for this one! WOOF!  I wished I could put a video of this but by reason this is not my dog but my neighbor's, I already asked his wife if I may run a video of this and her response was \"NO!\".  But I can tell you that their dog is 14 years old!"}
