{"Id":"83287","ProductId":"B005ZBZLT4","UserId":"AIR056KXB0MHC","ProfileName":"Jackie M \"NJBooks4Less\"","HelpfulnessNumerator":3,"HelpfulnessDenominator":4,"Score":4,"date":"2012-01-31","Summary":"SF Bay Fog Chaser K Cup - A pleasant surprise","text":"I saw this brand for the first time at a local supermarket yesterday and figured for $6.49 for a box of 12 (that's 54 cents a cup), I'd give it a try.<br /><br />As other reviewers have pointed out, its not actually a plastic K Cup but a rigid rim with a foil lid attached to a filter filled with coffee. The rim sits perfectly in my Keurig machine. When you close the lid of your machine, the product is punctured from the top only. The filter is sort of bowl-shaped and doesn't make contact with the lower puncture needle, but you really wouldn't want it to puncture a filter anyway - you'd have grounds in your coffee. It's a clever idea, actually.<br /><br />I was skeptical about this product because the box doesn't have the \"Keurig\" co-branding that all the others do, but given the variation to the cup design, I can now understand why. I was pleasantly surprised with this product. The taste was quite good and strong, and is the closest thing to real coffee-pot coffee that I've had in 3+ years of Keurig machine cup samplings. I had no coffee grounds in the cup, and it was quite satisfying.<br /><br />By way of background, my all-time favorite variety is Tullys French Roast, and I prefer dark roasts. The box for San Francisco Bay Fog Chaser says its a combination of their regular roast and their french. Its not as strong as Tullys French but it's definitely not weak. My machine is the B77 model which has 4 size settings. Going from small to large, I used the third size which is 7.25 ounces and I was very satisfied with the taste and strength.<br /><br />I wanted to start with the small 12 count box at the market to try them out. Really, who wants 80 cups of something you might not like? But now I know it's a winner, I'll be getting them here regularly where they are even more affordable."}
