{"Id":"16180","ProductId":"B0001BVD04","UserId":"A1SYLII0808HD6","ProfileName":"M. Allen Greenbaum","HelpfulnessNumerator":3,"HelpfulnessDenominator":3,"Score":4,"date":"2007-06-14","Summary":"41/2*  Working Guy's Cherry Soda","Text":"\"Boylan Bottleworks\"<br /><br />AS a charter member of \"Free Associators Anonymous,\" the company name is ripe with conotation: Pittsburgh. Giant pipes of metal and glass with sweaty workers downing a \"Boylans\" (or, shorter, sweeter: \"Hey, Trow Me a 'Boys'!\"  Ironworks, manholes made in Oakland, tough immigrants, and cherries blacker than coal. Coupled with The Bottle Americana, even a non-serious soda flavor like cherry has a certain gravitas, a don't-screw-with-me style, even though I'm rich enough to afford this.<br /><br />Speaking of serious, let's get on with the parlor game of tasting notes. Boylan's Black Cherry, as noted by others, isn't too sweet (cloying as the wine connosieurs will tell you), syrupy, and it tastes like cherries, especially upon entry and in a very satisfying aftertaste. However, a grape/apple flavor sneaks in under all this, so much so that I was surprised that Boylan uses cherry juice only.  It keeps Boylan's from perfection, just as the Amazon price may give you pause.  (Trader Joe's does it again--will this company ever do an IPO so that we can all get rich off its well-deserved popularity.<br /><br />Back to Boylan again.  It's strong enough to stand up to ice, the fizz is moderate--you don't lose half your cherries to foam--and it's quite tasty and refreshing. Again, the only minor problem I had was the perception of a grape juice filler, perhaps my imagination, or perhaps a characteristic of one of the varietals in Boyland's cherry blend. The competition is from other designer sodas (Kemper's, for example), and from cherry sodas made with the artificial flavors and colors that we all grew up to love. At this price, it's a treat, and the taste is so good it'll disappear quickly, but you're a working man or woman. You deserve this liquid luxury presented with no-nonsense attitude."}
