{"Id":"189380","ProductId":"B001EO5Q64","UserId":"A2NPL4ADWSCH91","ProfileName":"C Will","HelpfulnessNumerator":2,"HelpfulnessDenominator":2,"Score":5,"date":"2011-03-27","Summary":"New user and LOVE it!!","text":"I was searching for a lotion for my husband's psoriasis and the search engine brought up coconut oil!  I thought that was unusual, but decided to start researching coconut oil and its uses.  Wow!  This natural oil has so many uses and is extremely healthy!  It is anti-bacterial, anti-microbal, anti-viral, and anti-fungal.<br />  I've been putting it on my husband's psoriasis for three days, but it hasn't been long enough to tell yet whether it will help; I'll keep you posted.<br />  Awesome moisturizer--I've been using it for the last week as a body oil after I shower and everynight on my face before bed, and my skin is so smooth and soft!  It soaks right in as long as you use it sparingly with no greasy feeling.<br />  Natural deoderant--I found a homemade deoderant recipe on the internet today and will let you know in a later post how it works.<br />  Toothpaste Booster--Since it has anti-bacterial properties, I have been using 1/2 and 1/2 of my usual toothpaste and coconut oil to brush my teeth!  I know that sounds disgusting, but coconut oil does not feel oily in your mouth...honest!<br />  I have been taking 1T morning (with my calcium pills because it's supposed to help your body absorb nutrients more efficiently), noon and night without changing what I eat and lost two pounds in a week!  I was pleasantly surprised when I felt full for longer periods of time and was also eating less at each meal because I felt satisfied.  Another plus was that I was no longer constantly snacking in the evenings, which has been my worst habit to break but now I don't even feel like snacking!  Some people mentioned they<br />  I found my dog loves licking my skin after putting on coconut oil, so I've been researching to find out if it's good for dogs.  From what I've read so far, it is just as healthy for her, too!"}
