{"Id":"399815","ProductId":"B002IEVJRY","UserId":"A1YJMG0QJXZLD4","ProfileName":"Rosemarie","HelpfulnessNumerator":0,"HelpfulnessDenominator":0,"Score":4,"date":"2012-06-06","Summary":"Pleasant enough","text":"Summer is upon us and we are always looking for some cool drink to satisfy us in the heat. illy, issimo has always been thought of as a fine distributor of coffee.<br />They are on the up and up with their products disclosing all that is in the can, yes I said can, these coffee's are in the can.<br /><br />Before I continue allow me to state what the nutritional break down is:<br />Total fat 1.5<br />Cholesterol 5 mg<br />Sodium 60 mg<br />Total Carb 19 g<br />Fiber less than 1 g<br />Sugars 18 g<br />Protein 4 g.<br />Calcium 10%<br /><br />The ingredients are:<br />Coffee, Low Fat milk, sugar, cocoa powder, Potassium bicarbonate, cellulose gel,<br />cellulose gum,carrageenan.<br />And believe it or not they even listed the Caffeine content: 81 mg/8.45 oz<br /><br />The first thing I did when this came in the mail was get out a nice tall glass and fill it with some nice clear spring water ice cubes.<br />DO NOT SHAKE was on the label but I did it instinctively by mistake, actually I did it before I noticed I was not supposed to.<br /><br />My first thought when I took that first taste was, I am not too impressed, but the flavor is kind of nice, not to sweet and not to strong.  I do not like strong coffee.<br />It had the right marriage of coffee to milk to cocoa.  It is smooth and light and the flavors are very subtle.  The only thing is that it is not very impressive,.<br />Totally underwhelming, I think I can make a better iced coffee in my own kitchen, in fact I have.<br /><br />The bottom line is this is a nice sturdy product, if you offer me a can when I come to visit I would not turn it down but would I go out a purchase it for myself?  No, I am sorry it is nice but not that nice.  Summer is upon us and we are always looking for some cool drink to satisfy us in the heat. illy, issimo has always been thought of as a fine distributor or coffee.<br />they are on the up and up with their products disclosing all that is in the can, yes I said can, these coffee's are in the can.<br /><br />Before I continue allow me to state what the nutritional break down is:<br />Total fat 1.5<br />Cholesterol 5 mg<br />Sodium 60 mg<br />Total Carb 19 g<br />Fiber less than 1 g<br />Sugars 18 g<br />Protein 4 g.<br />Calcium 10%<br /><br />The ingredients are:<br />Coffee, Low Fat milk, sugar, cocoa powder, Potassium bicarbonate, cellulose gel,<br />cellulose gum,carrageenan.<br />And believe it or not they even listed the Caffeine content: 81 mg/8.45 oz<br /><br />the first thing I did when this came in the mail was get out a nice tall glass and fill it with some nice clear spring water ice cubes.<br />DO NOT SHAKE was on the label but I did it instinctively by mistake, actually I did it before I noticed I was not supposed to.<br />My first thought when I took that first sip was, I am not too impressed, but the flavor is kind of nice, not to sweet and not to strong.  I do not like strong coffee.<br />It had the right marriage of coffee to milk to cocoa.  It is smooth and light and the flavors are very subtle.  The only thing is that is is not very impressive,.<br />Totally underwhelming, I think I can make a better iced coffee in my own kitchen, in fact I have.<br />The bottom line is this is a nice sturdy product, if you offer me a can when I come to visit I would not turn it down but would I go out a purchase it for myself?  No, I am sorry it is nice but not that nice.<br />Maybe if you are an avid coffee drinker it will please you more than it does me, but that does not mean I dislke it."}
