{"Id":"189342","ProductId":"B001EO5Q64","UserId":"A3KG5Q302QXSCD","ProfileName":"M. Wang","HelpfulnessNumerator":7,"HelpfulnessDenominator":9,"Score":4,"date":"2009-10-28","Summary":"Near Perfect for popcorn, experimental for other things","text":"Edit:  Added a second part.<br />===============================================<br />Original Post<br />I use this with the whirleypop, which I'm expecting to break any minute, but that aside, this makes near perfect popcorn.  The coconut taste is a little bit stronger than what you'd find in movie theatres but overall a bit bland (which is not a bad thing).  I frankly prefer that than trading the health benefits for overly processed oil.  That and while I love coconut trading the near tasteless flavor of the oil for a strong coconut flavor would reduce it's versatility in cooking.<br /><br />So when you salt this lightly with popcorn it stands on its own.  But I season mine with kernel's seasons, splenda, sugar, some salty butter flavoring along with melted Nutiva, mixed then drizzled on top.  In short, it's one step short of heaven and the switch from Canola is immediate and amazing.  I honestly can't stop eating it and it is rather healthy in comparison to movie theatre popcorn as I use far less and still has a very similar oil fragrance and taste.  Yes I still treat it like an oil and use about 2.5 to 3 tablespoons for a 1/3 cup of unpopped corn.<br /><br />On that note, while I applaud the brave reviewers out there who put this on their hair, and eat it religiously daily this is still an oil.  Perhaps a high quality one and one I may put on my split ends one day, but to me this is a yummy cooking oil you use in moderation.<br /><br />It also is a tad expensive (hence subbing a star) and again I do find it too bland to use alone on toasted bread (perhaps it has to be toasted together in the toaster oven) but the quality and convenience is really good.<br /><br />So if you happen to use it in other ways, good on you but I am happy with using it sparingly, and simply for popcorn.  It seems much more useful to me than using it as the latest and greatest in health fads today.  Especially because oil, even when healthy, contributes a hefty amount of calories and fat to your diet.<br /><br />==========================================================<br />Note about the Coconut Oil Hype<br /><br />Seems like a few people are very into the hype, so much so that if you do not write an overly glorifying review of coconut oil something is wrong with you.  I'm not a believer in ONLY scientific studies and if that were the case I would not care for reviews by buyers from amazon.  And frankly I love you reviwers as you save me time and money.  However I do have a limit on what I hear from the internet.  And whenever there is the word \"miracle\" attached to something in the title I use a heavy amount of skepticism.  And MANY people believe coconut and coconut oil is a \"miracle\".<br /><br />Sorry folks it isn't.  I do realize all the benefits of coconut water by the way. Coconut water is extremely healthy and even used as in emergencies to substitute for human blood, but even so I would hesitate to call coconut water a \"miracle\" as drinking it alone is not a cure for aids, cancer, etc. as suggested by some. That, to me would constitute a true miracle. And if it were true, coconuts would have been discovered a long time ago as a cure for aids/cancer, etc.<br /><br />Coconut water is undoubtedly good FOR you and I love coconuts as a whole but do use some discretion when eating OIL.<br /><br />To me, if you're thin, eating fat is not so much an issue when the fat is healthier and you probably need some caloric substance. Extra virgin coconut oil, while still being researched, comes from a coconut and thusly is inherently healthy to some degree. However, if you're already overweight, then eating 3 tablespoons of oil, ANY oil, on TOP of what you eat amounts to 390+ calories extra which means you gain a pound in only 10 days.  It is VERY easy to overeat oil and that said I would really hesitate to overuse coconut oil or any oil without extensive studies.<br /><br />So those reading what I wrote, as of March 3rd, 2011 coconut oil is still being heavily studied.  Just google it if the following links do not show.<br />[...]If you're on the fence, don't consider it (or anything for that matter) a miracle until long term studies ARE done.  If it's oil, keep in mind moderation is always the key.  Don't buy the hype to eat 3 tablespoons a day if you're already overweight."}
