{"Id":"2990","ProductId":"B0011X5S8Y","UserId":"A1YUL9PCJR3JTY","ProfileName":"O. Brown \"Ms. O. Khannah-Brown\"","HelpfulnessNumerator":"1","HelpfulnessDenominator":"2","Score":"4","date":"2007-01-04","Summary":"Fun, Intense Holiday Tea","Text":"****<br /><br />Celestial Seasonings' Sugar Plum Spice is a delightful holiday tea. It contains hibiscus, roasted barley malt, roasted chicory root, rosehips, chamomile flowers, natural plum flavor with other natural flavors, ginger root, roasted carob, and cardamom. It does not contain caffeine, so it's technically an herbal tea.<br /><br />Celestial Seasonings has been around a long time, and makes quality teas. All of their teas are free of preservatives and artificial colorings and flavorings, all are certified Kosher and none use irradiated botanicals, which I appreciate. Although they use \"natural flavors\" in their teas, these natural flavors are derived primarily from fruits, spices and herbs, and never contain monosodium glutamate (MSG). They use environmentally conscious packaging and sustainable sourcing. To remove the caffeine from green and black teas, they use a process called \"effervescent decaffeination\" (using carbon dioxide). Celestial Seasonings justifiably takes pride in being a company that makes natural teas.<br /><br />On the package, Celestial Seasonings writes, \"Take a sip of Sugar Plum Spice and journey with us to the Land of the Sweets in Tchaikovsky's The Nutcracker. Here you'll find gingerbread houses, trees laden with sugar plums and days filled with sunshine. This is the land of the Sugar Plum Fairy, who is beautiful, gentle and kind. We created this tea to pay tribute to her. Sugar Plum Spice is made with 100% natural herbs and the festive flavors of plum and spice, with just a hint of sweetness.\" This tea is slightly sweet and full bodied, tasting just as you would expect from the description. The cardamom and ginger give it a little zing. Each tea bag packs a lot of flavor and I only need to use one at a time.<br /><br />I recommend it, even if it's not a holiday. It's perfect for a cold or wet winter day.<br /><br />****"}
