{"Id":"240082","ProductId":"B001VJ0B0I","UserId":"A3DH53FPYSP9E","ProfileName":"Media Man","HelpfulnessNumerator":2,"HelpfulnessDenominator":3,"Score":2,"date":"2012-06-12","Summary":"Dog enjoyed it, but poor grade food overall","Text":"My dog is a 62lb English Bulldog/German Shepherd mix that repeatedly suffers from allergies, especially food allergies. He can also be a bit of a picky eater when it comes to his food so finding the right mix can often be difficult. While he loves just about any treat, I always have reservations about trying new food. Unfortunately, a large majority of popular dog foods today are filled with terrible ingredients not to mention carrying a high price tag. I'm always willing to try a new food so here are my thoughts on PURINA Beneful Original Dog Food;<br /><br />Pros<br /><br />+ Dog liked it and gobbled it up.<br /><br />+ Resealable Ziploc style bag.<br /><br />Cons<br /><br />- Filled with tons of poor ingredients for your dog such as Ground yellow corn, chicken by-product meal, corn gluten meal, whole wheat flour, animal fat, soy flour, sugar, propylene glycol, meat and bone meal, animal digest, added color (Red 40, Yellow 5, Yellow 6, Blue 2), garlic oil, menadione sodium bisulfite complex. Artificial colors? Seriously? Do you really think the dog cares what color the food is when they eat it? Who are we trying to appeal to here, the dog or the person?<br /><br />- $22 is a bit expensive for a 15.5lb bag.  This food is often much cheaper at big box retailers and grocery stores.<br /><br />- Bag is plastic and currently not recyclable.<br /><br />My dog really enjoyed PURINA Beneful Original Dog Food.  However don't we all enjoy food that's bad for us? Unfortunately, that's exactly what this dog food is, bad for your dog. Someone said in a previous review if my dog was reviewing this food it would get 5 stars and my dog would agree with that. Lucky for him I know what's good for his health and PURINA Beneful Original Dog Food isn't it. With so many questionable and downright poor ingredients it's hard to really recommend this food for your dog. I definitely wouldn't purchase it again. Our current food is Nature's Domain Turkey Meal and Sweet Potato which is sold at Cost Co. It contains no potentially harmful ingredients, settles very well with my dog and is only $30 for a 25lb bag. If you're looking for a good healthy food, I recommend Nature's Domain brand or if you want to better educate yourself on what's actually in your current dog food I suggest visiting dogfoodadvisor.com. It's a great site that lists nearly all dog foods, breaks every ingredient and its properties down and gives a final overall rating on the food's quality."}
