{"Id":"132952","ProductId":"B0090X8IPM","UserId":"A1BA72K4VK1UN1","ProfileName":"Patrick W. Crabtree \"The Old Grottomaster\"","HelpfulnessNumerator":0,"HelpfulnessDenominator":0,"Score":4,"date":"2011-03-04","Summary":"Delicate with a hint of vanilla","text":"To be wholly fair to the product, I feel compelled to disclose that I'm not usually a brewed coffee drinker these days, except for restaurant outings. Having tried about every coffee around at one time or another, I find that <a href=\"http://www.amazon.com/gp/product/B003M1KTUA\">Nescafe Clasico Instant Coffee, 7-Ounce Jars (Pack of 3)</a> suits my personal tastes more than any other. I drink one cup black in the morning and a second in the late afternoon with lots of Half-and-Half.<br /><br />As for this product, it's quite a pleasant coffee with no bitterness whatever. If found it to be especially delicate in ambiance, even though I intentionally brewed it just on the strong side. Had I used this extra amount of coffee with other gourmet brands that I've tried, it certainly would have been much darker and bolder (and in all liklihood, harsh) in taste.<br /><br />I was surprised in regard to the vanilla (a flavoring that I generally like) aspect of the coffee. The aroma of the grounds is pretty significant and I expected a similarly infused flavor in my cup; however, the vanilla came through as little more than a slight nudge. I actually would have preferred a more prevalent vanilla taste had I gone specifically for a vanilla-flavored coffee. But this facet of the blend might represent a positive point for certain other vanilla coffee lovers.<br /><br />Would I personally buy this product? If there were no such thing as <a href=\"http://www.amazon.com/gp/product/B003M1KTUA\">Nescafe Clasico Instant Coffee, 7-Ounce Jars (Pack of 3)</a> then I could say with some confidence that I would buy some intermittently. I'm limited for health reasons as to the amount of caffeinated coffee I can drink each day so I'm looking for a *plain old roadside diner coffee* experience most of the time -- for brewed coffee that would be either <a href=\"http://www.amazon.com/gp/product/B000G1X45G\">Yuban Original Ground Coffee, 12-Ounce Cans (Pack of 12)</a> or <a href=\"http://www.amazon.com/gp/product/B000E1BM16\">Maxwell House Original Roast (Medium) Ground Coffee, 11.5-Ounce Cans (Pack of 12)</a>, and not a gourmet-type brand. If I were choosing a specific *Starbucks* blend for myself, it would be <a href=\"http://www.amazon.com/gp/product/B0034L2VUY\">Starbucks Christmas Blend 100% Arabica Whole Bean Coffee (1.56 lb. bag)</a> which I slightly prefer over the one under review here.<br /><br />However, I would not hesitate for a moment to serve the Starbucks Vanilla to either casual visitors or dinner guests, especially since the vanilla flavoring is so subtle. This is a quality product which I think many people will much enjoy."}
