{"Id":"399803","ProductId":"B002IEVJRY","UserId":"A1ZPY91VE3IDN1","ProfileName":"J. Offenbach","HelpfulnessNumerator":0,"HelpfulnessDenominator":0,"Score":3,"date":"2012-06-07","Summary":"If calories don't matter to you, might be worth a taste","text":"Four individual coffee lovers from different cultural backgrounds conducted a sampling of this <a href=\"http://www.amazon.com/gp/product/B002IEVJRY\">illy issimo Coffee Drink, Cappucino, 8.45-Ounce Cans (Pack of 12)</a> side by side with the <a href=\"http://www.amazon.com/gp/product/B002IEZJMA\">illy issimo Coffee Drink, Caff&egrave;, 6.8-Ounce Cans (Pack of 12)</a> and we had an exact split on the selection of a favorite between both samples.  Of note is that the Cappucino single serving can is a couple ounces greater and double the calories.  My personal preference was the Caffe because I found it to taste fresher, less like a canned beverage, less sweet, and stronger in the coffee flavor.<br /><br />I gave away my Nespresso machine and currently do not have an electric espresso maker other than the <a href=\"http://www.amazon.com/gp/product/B00009W5F0\">Delonghi EMK6 Alicia Electric Moka Espresso Coffee Maker</a> and prefer very strong coffee.  I still make it on the stovetop or prepare French drip coffee.  I sometimes use Splenda and froth steamed milk.  I used to roast green coffee beans but have also given away my roasters.  I grind beans prior to preparing coffee.  Just a little history for my frame of reference in writing this review.<br /><br />I'm not at all crazy about this coffee drink because my first impression was the sweetness, followed by the milky and very thin taste, and I experienced an aftertaste that I didn't care for.  I don't use much sugar, so that's perhaps why my taste buds were more sensitive, and as with all four tasters, although the ingredients listed Cocoa, we tasted very little in this beverage.  The coffee flavor was stronger than a simple cup of coffee, but the other flavors overwhelmed the coffee for me personally.  All three other tasters liked this flavor and said they would buy it if it's cost was around a dollar.  Two of the four tasters drink Chai regularly, always with lots of milk and sugar added.<br /><br />Our natural instinct is to shake a non-carbonated beverage, but there are strict instructions stating that the can is not to be shaken.  The can is nice to look at, smaller than a soda can and may cause problems in a beverage holder if you take these on a road trip.  At the current cost and weighing in at about 25 calories per ounce, I'm not going to recommend this product."}
