{"Id":"341232","ProductId":"B001RVFEP2","UserId":"A2I18AO597DSDI","ProfileName":"David Pearlman \"sound fanatic\"","HelpfulnessNumerator":1,"HelpfulnessDenominator":1,"Score":4,"date":"2010-08-02","Summary":"A lower calorie alternative to standard chips: 120 calories/oz. A bit flavorless in native state but good when flavored","text":"The eternal dieter's quest: A replacement for oily, fatty, and oh-so-addictive real potato chips. Sure, you can get the baked versions, but they lack a bit in both the crunch and flavor categories. And they cost a lot.<br /><br />So the quest continues. I got a case of these PopChips, cheddar flavor, through Amazon, inspired by a good sale and thoughts of \"there must be something better\".<br /><br />The first thing I noticed was the calorie count: A substantial 3oz bag of these chips (a lunch bag is 1oz) has only 360 calories (120 calories per \"serving\"), of which 35 are fat calories. Those are better numbers than tradition potato chips, which run around 160 calories for a 1oz serving, and which get 80-90 of those calories from fat. (Calorie counts can vary dramatically upward depending on the chips, but these numbers are typical). Better--and this is where the calories don't tell the whole story--a 1 oz serving feels larger, because these PopChips are puffed larger.<br /><br />But don't let that word \"puff\" scare you. They DO have a major non puffy tasting solid crunch to them. The flavor is also pretty good and the best part: Look Ma, no orange crap on my hands! That's a big plus for a cheddar flavored chip...Take that Cheetos!<br /><br />I liked the cheddar ones so much, I ordered the BBQ ones as well, and they're even better tasting (IMHO).<br /><br />One thing to note: These are low(er) fat, low(er) calories, but not low sodium. A 1oz portion has 290mg of sodium (12% of the recommended daily intake for a normal person). If you are on a salt restricted diet, or if you don't like salt, think twice...<br /><br />On the whole, these are good, tasty, and most importantly, satisfying, while at the same time less caloric (and much less fatty) than standard potato chips. They are saltier than many would prefer, but presuming you are not on a salt restricted diet, they'll be OK. As a bonus, they are supposed \"all natural\". Personally, I don't care about that last point, but it's certainly not a bad thing!<br /><br />One last thing: You will find some diets that claim it's not the calories, it's the source of the calories. Hogwash. It IS the calories. No chip is diet worthy in big quantities. Consider the calories and  your total caloric intake, and make the personal decision whether these make sense.<br /><br />Try them yourself...Amazon offers a sampler package with multiple varieties, and that might be the best way to sample them."}
