{"Id":"12050","ProductId":"B003H7YHUW","UserId":"A204G7E13UW2B0","ProfileName":"Andrew Schonbek","HelpfulnessNumerator":3,"HelpfulnessDenominator":5,"Score":3,"date":"2010-12-27","Summary":"Deconstructing Environmental Cred","Text":"There's nothing really wrong with these sardines, though as noted below I don't particularly care for their smoky taste. My problem is with the marketing, which attempts to justify an inflated price with a dissertation of a long list of purported benefits. Problem is, most if not all of these benefits apply to all brands of sardines, not just these.<br /><br />One thing I'll say at the outset: If BPA free packaging is your most important purchase criterion read no further and buy these now. The packaging is indeed BPA free.<br /><br />But what about the whole concept of \"wild\" sardines? I'm not aware that the sardine has been domesticated, and the lowly pilchards that swarm the seas in massive schools sometimes visible from outer space are not amenable to aquaculture.<br /><br />On the other hand, qualifying these sardines as wild, notwithstanding the fact that all sardines are wild, does confer a seemingly significant though clearly misplaced credibility. No doubt this will boost sales to a gullible buying public.<br /><br />Read the packaging for these sardines and you can't help but feel you're saving Mother Earth as you chomp on your sandwich. But digging down beneath the surface, there's not so much to be excited about.<br /><br />For instance there's the matter of what happens to these fish after they're \"sustainably caught along the California coast\". The small print provides a clue in that these bad boys are \"processed in Viet Nam\". So what's really going on is that our diminutive sardines take on a heavy carbon footprint, travelling as they do from the west coast to the far east and back again, presumably to harvest the otherwise mutually exclusive benefits of buy-local chic and low labor costs. Nonetheless, we read that, \"These sardines are considered a `Best Choice for Sustainability' by a consensus of environmental organizations\".<br /><br />There are other issues as well.<br /><br />The health benefits of chowing down on this product are highly touted. For instance, \"Ounce for ounce, Wild Planet sardines provide 3 times more calcium and phosphorus than milk...\". OK, fair enough. But is this, as implied, unique to the Wild Planet variety only, or is it once again a characteristic of all sardines? Unfortunately, it's the latter.<br /><br />We also learn that these \"delicious meaty portions\" are \"cleaned and scaled\". Buyer beware: this is quite different from \"skinless and boneless\". \"Cleaned\" in this context must mean something other that what is commonly expected by the use of this word in conjunction with fish. Be prepared to either eat the vertebral column and various entrails, or to remove (clean) them yourself.<br /><br />How do they taste?<br /><br />Not bad, if you're into schmaltz herring. These babies are smoked and have a characteristic smoky, salty taste.<br /><br />But don't worry. It's not just any smoke, but \"aqueous natural smoke\" that they're treated with..."}
