{"Id":"1220","ProductId":"B005O072PC","UserId":"A3UAV8WK31RJY5","ProfileName":"Captain Cap \"Captain Cap\"","HelpfulnessNumerator":"1","HelpfulnessDenominator":"1","Score":"4","date":"2012-07-10","Summary":"A+","Text":"I received 4 of these in my first ever Omaha Steaks order that I received today. I wasn't sure what to expect, but so far, I've been pleased. I tore the plastic open, put the frozen potato on a baking sheet in the oven and put it on 350. 45 minutes later it was done and turned out being delicious. The cheese filling was crispy on-top and the potato itself underneath was nice and soft. No way would they come out as good if put in the microwave, so I'd say oven cooking these is definitely the way to go. Now, you can obviously make your own stuffed baked potatoes for far cheaper then what Omaha charges for these alone, but as long as you get a good deal on the Omaha website, these simply make a great addition to any Omaha steaks order. As delicious are they are though, I wouldn't order a box of JUST these off the site due to the added shipping costs. But like I said, as long as they're part of a nicely priced packaged deal, I'll definitely take them. Actually, I probably wouldn't order any packaged deal in the future from Omaha that didn't include these. A big plus, at least for me, is if you check the ingredients list on these, there's no partially hydrogenated oils, so there's no traces of trans fats, which is very rare with stuffed baked potatoes. Also no high fructose corn syrup, which is another rarity on a food product like this and is always a plus. If you make your own or buy them frozen from your grocery store for example, chances are, the butter used, sour cream, etc. will be full of chemicals, trans fats & high fructose corn syrup. These, not so much. So there is a definite degree of quality with Omahas stuffed baked potatoes. Each potato does have 8 grams of saturated fat, which is 42% the DRV, but that's obviously to be expected with anything that contains bacon, cheese and sour cream. I was also expecting there to be no fiber, but it turns out there's 3grams of fiber per baked potato half. Another plus. Overall, the stuffed baked potato was very tasty and actually relatively healthy, being made with quality ingredients."}
