{"Id":"6850","ProductId":"B001LG945O","UserId":"A3F1G6UH4Y39X2","ProfileName":"Linda G. Shelnutt \"Mystery Novelist\"","HelpfulnessNumerator":"1","HelpfulnessDenominator":"2","Score":"5","date":"2009-03-14","Summary":"A Wish for Guilt Free Flavor","Text":"The first sip gave a pleasing flavor burst with a light tang of carbonation.  When testing the black cherry flavor, I had placed the can in the freezer for a short period, since I prefer drinks to be ice cold or hot; I didn't want lukewarm to get in the way of a positive response to the first sip.  As the drink warmed a bit, the sweetness overtook the carbonation, which is inevitable in a carbonated beverage, yet, due to the purity of the fruit base, the flavor remained true and welcome.<br /><br />When trying the kiwi flavor, I just had the drink chilled perfectly for me, no ice crystals.  I like the kiwi even better than the cherry!  The kiwi has more tang.  See below (or on the product description on the buying page) for the juice blends used.  I've noticed that most juices currently have apple and grape included, likely because those are cheaper to produce.<br /><br />The way the drink was promoted wasn't a lie!  It worked for me:<br /><br />1. \"100 % of what you want.  0% of what you don't want.\"<br /><br />2. \"Make The Switch to a great tasting, all natural beverage that's the perfect balance between JUICE and CARBONATION.\"<br /><br />3. The logo has \"THE\" placed upside-down and reversed, atop \"Switch,\" with a swirl designed around the words, the swirl imitating the symbol for reversing something.<br /><br />4. The ingredients read: \"100% juice (filtered sparkling water sufficient to reconstitute juice concentrates, apple, grape, kiwi, acerola* [I added the asterisk; see below] and raspberry and strawberry juice concentrated), natural flavors, ascorbic acid (vitamin C)\"<br /><br />5. 100% juice carbonated.<br /><br />6. The can is smaller than the norm for soda pops, which I also liked, because when I used to drink sodas regularly, I usually opened a can and left half of it to get too warm (and fizzed out), so the remainder went down the drain (after I returned it to the fridge for a few days hoping I might drink it).  I drank the whole can of Black Cherry!<br /><br />I decided I liked the near slush state of a short stint in the freezer... leaving it too long, though, might cause too much separation of the fruit concentrate from the fizz water... and, of course, makes it undrinkable from the can until it melts enough to flow through the hole in the top.<br /><br />In the past, when I had begun wanting something more natural than most soda beverages (with phosphates, etc., added), I had used frozen orange juice concentrate added to Club Soda or Ginger ale.  It didn't take long to feel that the process was too much trouble (and it was more expensive than the cost of the Switch product).  Also, I like the types of fruits Switch is using.<br /><br />At first I was confused at the acerola* ingredient, not knowing what it was.  Since my <a href=\"http://www.amazon.com/gp/product/B00154JDAI\">Kindle 2: Amazon's New Wireless Reading Device (Latest Generation)</a> was at hand, as always, I looked up acerola in the onboard dictionary.  The word wasn't in there, so I pushed the curser to the right, on the arrow for more types of searches, and used my standby, Google, and found several listings of acerola.<br /><br />Briefly, I found that it's thought to have originated from the Yucatan, and is known as Barbados cherry or wild crape myrtle, a tropical fruit-bearing shrub.  Reading into the variety of praiseworthy qualities of that cherry, I was impressed!  It has 32 times the amount of vitamin C as Orange juice, and many other healthful assets.  If you're interested in details, feel free to go Google.<br /><br />I'm beginning to think that many of the flavors available from Switch will include equally intriguing tropical fruits.  (I was glad to see that other flavors also have acerola in them).<br /><br />Though the can is appealing and fine, this beverage is good enough to deserve a designer bottle to appeal to the gourmet crowd who want flavor without true health issues... don't get me started on the myriad of heavy promotions of pseudo health issues.  I have a book in progress to be published on KINDLE, which will debut with steam hissing out of Kindle's ears, at no extra charge!  (I'll add a comment to this review about why I had quit drinking soda pops, which will explain why I will be happily able to welcome Switch into my diet.)<br /><br />My thanks to THE SWITCH for providing a healthy, gourmet quality drink... WITHOUT, thank God, SOYBEANS added!!<br /><br />I'm hooked!<br /><br />Linda Shelnutt<br />Author of several Kindle books and Amazon Shorts<br /><br />P.S.<br />With chagrin and apologies I've had to add comment updates here"}
