{"Id":"65838","ProductId":"B0007A0AQW","UserId":"A3ARVWLRF8WPPZ","ProfileName":"Lilly Miller","HelpfulnessNumerator":0,"HelpfulnessDenominator":0,"Score":5,"date":"2012-04-24","Summary":"Zuke's Salmon, Chicken, and Rabbit work well for my picky dog!","text":"I've been using Zuke's Mini's for training since I first brought my girl home and she (surprisingly, for she's quite picky) still tolerates them and *sometimes* even seems to want to work for them. (Not having a food motivated dog SUCKS for training - I could literally be walking around with big macs in my pockets and it just wouldn't matter) They are low calorie and reasonably cheap (I can actually find them at some local stores cheaper than I can on Amazon, sometimes) as the bags tend to last a while. (I actually use kibble mixed with the treats when working with her, becuase I'm sneaky like that and she doesn't notice the difference once we get going)<br /><br />Of course not all dogs work with all treats - and it SHOULD be noted that although these treats do not have a lot of the \"bad\" ingredients in them they still do have grains. (NO grain treats have a much different texture, either from being pure meat or using various ingredients as the \"binder\" necessary for treats like this)<br /><br />This is the only type of treat we feed that has grains in it; almost everything else she eats is pure meat in various fashions. (lamb lung, water buffalo, venison, rabbit, etc)<br /><br />If you have a dog with allergies you may want to try some of the grain-free options for training treats, like the mini lamb lungs or mini beef jerkies, etc. For our needs, though, these are perfect. \\<br /><br />I was SO psyched when I saw that they came out with the \"rabbit\" variety! I try to keep the variety going in her diet and she doesn't like the peanut butter kind so it was always down to alternating between chicken or salmon, both of which are very common proteins. I can't tell if she likes this kind more or not, but she's definitely eating them which is a good sign! They tend to be more expensive than the other variety so I don't buy them as often, but love including it in the mix!<br /><br />One last thing I wanted to mention, my Mom has small dogs (tiny chihuahuas) and they can eat this size training treat with ease. However, I recently purchased the SMALL training treats for her (they are usually about 1/2 cal per treat) and she said that they are PERFECT for her sized dogs that she is constantly trying to diet. I don't believe they are made in that size by Zuke's but there are several brands out there that also use similar ingredients (no bad preservatives, no corn, by products, etc) that may work better for very small dogs."}
