{"Id":"18870","ProductId":"B000F4H5FY","UserId":"A3NVB6HKMUH2NM","ProfileName":"Douglas C. Meeks \"doug_meeks\"","HelpfulnessNumerator":1,"HelpfulnessDenominator":1,"Score":4,"date":"2011-12-04","Summary":"Actually the tea was two 5 Star, one 4 Star and one 1 Star","Text":"Let me preface this with a brief history of my tea addiction:  Until I was approximately 40ish I thought all tea came with ice and enough sugar to make it into the infamous \"brown kool-aid\".  Since I only drank tea at restaurants and my Mom's at obligatory dinners, no big deal.  Well as I slipped towards 50 I began to drink more coffee (which I liked) but which eventually led to a parting of ways due to the fact that the coffees I liked, did not return the favor and feeling slightly nauseous was not the desired effect I was looking to achieve.  One day a friend of mine suggested I try some quality tea (which meant nothing made by Tetley/Liptons/etc).  I tried <a href=\"http://www.amazon.com/gp/product/B0000DBN2F\">Tazo Passion Tea, 24 Tea Bags</a> and while good it was missing that elusive element combination of good taste and adequate energy boost.  So I stumbled into this item <a href=\"http://www.amazon.com/gp/product/B000F4H5FY\">Twinings Variety Pack of Four Flavors, Tea Bags, 20-Count Boxes (Pack of 6)</a> which gave me 4 choices (great idea).  So without any additional ramblings are my opinions:  English Breakfast Tea = 5 Star, this stuff is great  /  Irish Breakfast Tea = Again 5 Stars, maybe a infinitesimal edge over the English version / Earl Grey = 4 Stars, good taste and flavor, not as good as the breakfast teas (IMHO) but probably better for later in the evening  / Lady Grey = WTF??  This stuff was horrible, I tried to use 1 bag of it with 2 bags of the others to keep from pitching it into the trash but to no avail, I am gonna give it to someone who has no taste buds.  1 Star.<br /><br />Again, realize I am far from a connoisseur of fine tea but I know what I like and what I don't, I am going to buy a few boxes of the breakfast teas and enjoy them.  BTW I also bought a huge box of <a href=\"http://www.amazon.com/gp/product/B000XEV9YE\">Taylors of Harrogate, Yorkshire Gold Tea, 160-Count Tea Bags</a> and to prove my tastes are obviously out of the norm I hated it (I wanted to love it but alas it has something added to it that sure ain't tea)"}
