{"Id":"344306","ProductId":"B0026KNQSA","UserId":"A1HBC0NBQJHT7X","ProfileName":"Bookphile","HelpfulnessNumerator":73,"HelpfulnessDenominator":77,"Score":5,"date":"2010-02-10","Summary":"Not exactly like traditional potato chips, but a great substitute","text":"One of my biggest frustrations with doing Weight Watchers was always the problem of finding good chips.  I will eat the baked ones, but they are undeniably very different from regular fried chips.  In addition to this, I've never been able to find a baked chip that came in salt and vinegar flavor, which is my favorite type of chip.  This meant that, whenever I had the craving for this particular flavor, I'd have to eat the regular fried kind.<br /><br />I picked up an oversize bag of the barbecue flavor Pop Chips on a whim at Costco.  I'd heard about them and was curious about what they're like, but I'd never before been able to find them in the area.  Much to my surprise, my very thin husband who is totally addicted to barbecue chips loved them and pretty much ate the whole bag before I'd had any.  I had tasted a couple of them and thought the barbecue flavor was good, so I decided to go ahead and order the individual bags from Amazon in barbecue for him and sea salt and vinegar for me.<br /><br />They are definitely worth the money.  I want to emphasize, however, that you will not be fooled into believing these are the regular old fried chips.  The taste and texture is something like a cross between rice cakes and chips.  I say rice cakes because they have something of that puffed look that rice cakes do.  Still, they are very good and the salt and vinegar is nice and strong, which is just the way I like them.<br /><br />As for the portion size, it's pretty generous.  For my fellow Weight Watchers, they are 2 points per bag, and they definitely make for a satisfying, filling snack or a side for your sandwich.<br /><br />I would definitely recommend these to anyone who is sick of the limited flavors of baked chips and would like something that comes in a wider variety of more exotic flavors.  I'm planning on trying the parmesan and garlic next."}
