{"Id":"2610","ProductId":"B0016FY6H6","UserId":"A1OAZUFZTEEUEC","ProfileName":"Jeffrey R. Ballard","HelpfulnessNumerator":"9","HelpfulnessDenominator":"9","Score":"5","date":"2008-10-03","Summary":"great alternative to bottled green tea","Text":"The first part of this review is a history of my health problems and what green tea bottles and sugar had to do with me finding the stash teas products. If you do not want to read that part, skip down to the bottom, and there is the review of the stash teas, only.<br /><br />---------------------------------------------------------------------<br /><br />A couple of years ago I had a physical and my doctor told me that my Triglycerides were high. I was a serious soda drinker (sometimes as many as 5 cans per day, not diet), so I decided I needed to start drinking something \"healthlier.\" I gravitated toward Green Tea because I like it. I averaged 2-3 1/2 liter bottles per day for 2 years (I also averaged about 1-2 cans of soda per day).<br /><br />I recently had my triglycerides checked again and instead of going down THEY DOUBLED. They were over 300 (over 150 is considered high). I about had a heart attack right there. Now, I am not an overweight person, and have had a fairly high motabolism, but I have started to create a belly (I call it a Dr. Pepper belly because that is my favorite soda. I do not drink alcohol of any kind). I am telling all of this to you because ALL of my other tests came in within normal levels, including all other aspects to my cholesterol.<br /><br />I did research and found out that if you are not overweight but have weight gain around the belly area, it might be due to consumption of a lot of sugar products. The excess sugar consumed, in this case, can be turned into trigylcerides. I looked at what I was eating and drinking to see if this was the case for me. What I found shocked me. The 1/2 liter bottles of green tea has MORE sugar in it than a can of soda. I checked several different manufacturers of green tea and I found them all to have about the same amount of sugar.<br /><br />I concluded that between my morning coffee, green tea bottles and soda, I was consuming over 1,100 grams of sugar a week ( or about 4,000 callories of sugar a week just in drinks)!!<br /><br />-------------------------------------------------------------------------<br /><br />I was looking for an alternative to the green tea bottles and found the stash tea products. I personally, do not have the time or patience to use tea bags, so I was interested in the tea powders. I ordered the lightly sweetened green tea powder and tried it. And I loved it. I then proceeded to buy the other 5 flavors of the green tea powders and love them also.<br /><br />There are 4 flavors that do not have sugar added, so I use a few drops of Stevia Glycerite to sweeten the drink. It does not take a lot.<br /><br />The best thing is that the tea powders cost about 1/2 or less than the bottled green teas I use to drink.<br /><br />---------------------------------------------------------------------<br /><br />To end on a personal note, I have altered my drinking habits and now drink 1 liter of the tea powder drink and 1+ liter of water per day. I still drink 1 can of Dr. Pepper on the weekend, but that is it. I have been doing this for a little over a month now and between my altered drinking habits and the fish oil pills, I have lost about 5 lbs. and am due to get my triglycerides checked in a couple of weeks.<br /><br />I hope this helps anyone that is in a similar situation to me and realize that just because it says its healthy does not mean it is."}
