{"Id":"6920","ProductId":"B001LG945O","UserId":"A3MWP39R0W9TQX","ProfileName":"H. Woodbury \"heartful_home\"","HelpfulnessNumerator":1,"HelpfulnessDenominator":1,"Score":3,"date":"2009-02-24","Summary":"Going beyond sugar water + CO2","Text":"A nutritionist once told me she could find something good about every food...except soda. Pop is full of CO2 (carbon dioxide), something our body is trying to get rid of, and refined sugar (which can ruin the teeth and provides empty calories). But even so, I still love it. I love the fizz tingling down my throat while while cleaning my palate and replacing it with sweetness. Nutri-sweet brings down the calories at the expense of flavor and has side effects like headaches and giving me a gnawing hunger.<br /><br />For fun occasions, I'll mix lemon-lime or plain soda water with juices for a delightful, and slightly healthier alternative to soda. Will the Switch Orange Tangerine soda live up to my expectations? A carbonated juice in a can?<br /><br />At first glance, the Switch can is...cute. It's a slender can with nice artwork. Fun to hold in your hand when you're used to the typical can.<br /><br />But when I taste it, I'm sorry to say, I'm a little disappointed. The Orange Tangerine Switch soda is not as tasty as regular orange soda, nor as orange juice. For a disclaimer, I'll mention that orange juice is not something that would normally taste great carbonated, so the other flavors of Switch might taste better. I got a kind of odd, bitter taste as I drunk the soda, but afterwards there was a pleasant aftertaste. The bitterness might be present in regular soda, but this is orange juice (with some others mixed in) and I know how it tastes without carbonation.<br /><br />I gave the Switch soda to both of my daughters who happily swigged it down with no concern from the odd taste I noticed.<br /><br />So while I won't be happily exchanging my occasional soda for Switch, I'm glad they are trying to do something a little healthier than we can feel more comfortable giving our children. And really, on a hot day, this would hit the spot."}
