{"Id":"17260","ProductId":"B005DM3N2M","UserId":"A32BB93M3NU59K","ProfileName":"Sarah Thompson \"Particular about products!\"","HelpfulnessNumerator":5,"HelpfulnessDenominator":18,"Score":2,"date":"2012-03-06","Summary":"What are the 4 flavors????","Text":"I don't understand why the flavors included in this variety pack are not listed in the Product Features section, just below the photo.  One has to read down PAST the legal disclaimers to find what flavors are included.  And even once one gets to the Product Features section which reveals the included flavors, one must first get past the hype:<br /><br />Product Description<br />Every refreshing variety lets you add flavor to you water without adding calories. These are great for bottle water. Comes with 4 flavors; Wild Strawberry, Raspberry Lemonade, Natural Lemonade, and Cherry Pomegranate<br /><br />Despite the concerns that Aspartame is not harmless, I do drink a lot of Crystal Light.  Sugar is not harmless either, for some of us.  I can't afford the sugar and calories in real fruit juices as a beverage choice more than once a day.<br /><br />Crystal Light \"Natural\" Leomonade flavor is delicious.  What I don't understand is why all of the other flavors have a bad aftertaste.  I suppose it must have something to do with the  tartness of the lemon-like flavor that disguises it.<br /><br />\"Natural\" Lemonade: aside from the ridiculous use of one of big fake food's favorite BS terms, \"natural\" (good grief, just look at the ingredients list!), this, for my taste, is the best Crystal Light flavor.  Though it's not what most people would consider natural, it does \"taste\" remarkably like real lemonade. However, I do use nearly twice the amount of powder and loads of crushed ice to get that taste.<br /><br />Raspberry Lemonade: Artificial tasting, slight bad aftertaste, you can improve this by adding half a real squeezed lemon. This used to taste better, but about a year ago it changed.  It still has less of the aftertaste than most of the other flavors.<br /><br />Wild Strawberry: Too fake tasting and terrible, strong, bitter, fake sugar aftertaste.  Almost as bad  as saccharine.<br /><br />Cherry Pomegranate: ditto<br /><br />My final complaint is the cost. I think there's a good deal of corporate greed involved here. I imagine the profit margin is astronomical. (Yeah, I know, I don't \"have\" to buy it.  They don't \"have\" to be greedy ba$t@rd$ either.)"}
