{"Id":"7810","ProductId":"B00474H936","UserId":"AFI9UK09BNR12","ProfileName":"TheVegetarianCarnivore","HelpfulnessNumerator":"0","HelpfulnessDenominator":"0","Score":"2","date":"2012-10-07","Summary":"Mixed review: convenient, okay taste, bad stomach problems","Text":"I bought this mainly because another review (can't remember if it was on Amazon or another site) said it was better than Morningstar Farms crumbles and because it is GMO free. Now, I've been a vegetarian since I was thirteen (and that was decades ago), but I am the sort that DOES want fake meat resembling meat. I've little interest in a mushroom-quinoa burger; I want a meaty-yet-vegetarian burger with mushroom quinoa on the side. Also, I'm a professional chef, so I'm very picky about the foods I eat.<br /><br />I'm saying this because I think it is important to know what the reviewer likes to eat when you base your purchase on a review.<br /><br />Tonight, I used the Harmony Valley hamburger mix in lasagna alla bolognese. I also did the same recipe with the MF crumbles to compare. Two things I was curious about:<br /><br />1) flavor: they're *kind of* about the same, especially considering I was adding a browned mirepoix, marmite, and veg Worcestershire ... I guess I should fry up a patty of just the HV mix, but I did eat a raw spoonful and it was okay, but blander than MF<br /><br />2) texture: MF wins. It just does (sorry, MF haters). It has larger pieces with a more meat-like texture. Plus, even after absorbing water in the fridge and then simmering on the stove, the HV was too wet.<br /><br />Now, the reviewer who also liked it better than MF also said something about it holding together on its own and that MF doesn't. Well, that's true. This was thick and stuck to itself, much more like the texture of ground meat - if you were to puree it. I use MF often in meatballs, and it holds together when bound with eggs and cheese. I guess that's the difference; I don't just want to thaw or add water and *poof* have dinner. I expect to cook with an ingredient, the same as I would with real beef.<br /><br />So I wasn't bowled over in those ways, but I liked it. HV hamburger mix is good and I'm sure it will be useful, which is also a plus - no worry about not having bought a bag of frozen crumbles, you've got a half dozen packets at home. I have a tiny little freezer for someone who cooks for a living, so it is always an issue for me to be able to keep ingredients at home. And although I've seen some reviews complaining about the 15-20 wait for the HV mix to absorb water in the fridge ... really? Those people can't wait half an hour for a burger? If you want an instant veggie burger that can be microwaved in the time it takes you to grab the ketchup, buy a frozen burger. I think this mix will be good in better handmade veggie burgers and I look forward to trying!<br /><br />Addendum:<br /><br />After eating the lasagna made with the HV mix, both my husband and I experienced horrible stomach bloating and pain. I'm apparently a glutton for punishment, though, because I decided to give it another try and made meatballs with it yesterday. Not only did they not turn out as good as my usual ones (made with MF crumbles and Lightlife sausage), they had a sort of rubbery texture that I really did not care for. But, blander and texture I can overlook, except AGAIN, the product gave us both the same horrible stomach bloating pains and gas. Ugh!"}
