{"Id":"399818","ProductId":"B002IEVJRY","UserId":"A27H9DOUGY9FOS","ProfileName":"K. Harris \"Film aficionado\"","HelpfulnessNumerator":0,"HelpfulnessDenominator":0,"Score":3,"date":"2012-06-05","Summary":"Smoother Than Other Illi Issimo Products, Likable Enough But Not Something I Would Frequent","text":"Through the years, I've tried just about every pre-made coffee beverage imaginable. I am a coffee lover and enthusiast, so I'm married to the idea of buying a can or bottle of a delicious coffee based product that I'll live happily ever after with. My experiences, however, have yet to yield bliss. Some are just fine, but nothing has ever made me say \"Wow! I'd like to drink this all the time!\" I had heard some positive things about the illy issimo brand, so given the opportunity--I sampled both their Caffe and their Cappuccino.<br /><br />Caffe (2 1/2 stars) is, in their own words, an Italian Espresso Style Coffee Drink. At first, I thought this drink had a strong and pronounced coffee flavor. But something is slightly off. The more I drank, it seemed too sweet and too bitter at once, which is a strange and not altogether pleasant combination. As it is essentially comparable to drinking an iced espresso, it may not be as palatable as some of their other creations. But, it's not really something that I would sample again. And at an approximate cost of $2.00 per can (only 6.8 ounce), this serves more as a caffeine boost than a refreshing beverage. Made with real Arabica coffee, I was also intrigued by the \"Do Not Shake\" warning which left me with the unappetizing visual of the particulate matter that must still be in the liquid drink (fine for Turkish coffee, not so appealing for something in a can).<br /><br />Cappucino (3 1/2 stars) is, in their own words, an Espresso Style Coffee Drink with Lowfat Milk and Cocoa. So, at 8.45 ounces this is a slightly bigger drink. As some of the harshness is buffered by the milk and cocoa combination, this one easily had a more pleasant taste. Still, a bit sweet for my liking but better overall. I'm still not blown away and I won't be a regular purchaser of this, or any illi issimo brand drinks, but I didn't dislike this one. Nice enough once in a while, but not inspiring enough to purchase a case. I guess I'll remain a fresh made kind of coffee drinker! KGHarris, 6/12."}
