{"Id":"19090","ProductId":"B003SBRUC4","UserId":"AIOPIWA4Q6GAJ","ProfileName":"veronica s","HelpfulnessNumerator":6,"HelpfulnessDenominator":9,"Score":3,"date":"2011-07-27","Summary":"Still contains artificial sweetener","Text":"I never, ever drink 'diet' sodas and try to avoid most soda in general.  However, I do really enjoy <a href=\"http://www.amazon.com/gp/product/B003SBW50G\">Blue Sky Organic New Century Cola</a> and was curious to try a sugar-free version.  Ultimately, I decided to go with the root beer 'free' soda over a cola because I figured the stronger taste would better cover any strange stevia taste or aftertaste.  I don't buy or consume stevia in other products so I'm not really sure how it tastes on its own, but it's really not bad in this soda.  It also doesn't dry out your mouth like other sweeteners.  This soda definitely has a unique taste but, as another reviewer pointed out, I think you are mostly tasting the \"french sweet birch oil\" per the ingredient list.  It also lists tahitian vanilla, hence the 'creamy' aspect.  The ingredients are quality and while it still has zero nutritional value, it's a better bet over regular or other diet sodas by a long shot.<br /><br />One thing I do not like is the misleading description: yes the soda does contain stevia as a sweetener but it is the second to last ingredient on the list.  The second ingredient out of seven is erythritol, which is a sugar alcohol, and NOT how this product is advertised to be sweetened.  Via wikipedia, it is \"60-70% as sweet as table sugar yet it is almost non-caloric, does not affect blood sugar, does not cause tooth decay, and is absorbed by the body, therefore unlikely to cause gastric side effects unlike other sugar alcohols.\"  However, I bought this product because I wanted a natural (Stevia leaf) sweetened product rather than another lab-generated chemical.  Disappointed.  I'll probably continue to drink them over time, but will not be reordering.  The stevia content is minimal at best, with the main ingredients being filtered water and erythritol.  I'd rather consume 100 more calories and drink the natural and organic regular Blue Sky cola or root beer.<br /><br />You ARE still consuming an artificially-sweetened-with-chemicals drink!  If you're okay with that, the taste is nice.  But if, like me, that is exactly what you are trying to avoid, this product is not it."}
