{"Id":"17730","ProductId":"B000Z978SS","UserId":"A1SO1PGDNVMLXC","ProfileName":"kalyson","HelpfulnessNumerator":91,"HelpfulnessDenominator":94,"Score":5,"date":"2008-08-10","Summary":"Great stuff!","Text":"If you do some research on natural sweeteners with a zero glycemic index, you will see that Erythritol is one of the best.  It is a sugar alcohol found in various fruits and vegetables like Xylitol.  But unlike Xylitol, it is not dangerously toxic to dogs and does not have bloating, gaseous effects.  If you don't need a sweetener without blood sugar effects, you can look at brown rice syrup or agave, since they have a very low effect on blood sugar.  If you want no blood sugar effects at all, I'd recommend this, since it has a very nice taste (like sugar) with no aftertaste.  Stevia is another option, but is very strong and has a less appealing taste.  If you use even a bit too much, Stevia generally has a rather bitter aftertaste.  This is not true of Erythritol.<br /><br />I would say the only downside is the cost and that it is only 70% as sweet as sugar.  You can spike it with Stevia to make up the difference if you like Stevia.  It doesn't take much to add to get it a lot sweeter.  You should shake it up really well before using, though.<br /><br />Note: If you want to buy this particular item, I discovered that this company has not charged me extra shipping for more bags going to the same address. I would avoid EmeraldForest, though, because the Erythritol I got from them had a very strange, foul smell -- like mothballs -- and had a faint aftertaste that was the same. Their customer service was very nasty when I called to return it, in spite of their \"100% satisfaction guarantee\". I am sticking with Now Foods from now on.<br /><br />Also:  It is a bit misleading that they call this particular item \"powdered\".  Regular powdered sugar is pulverized and has cornstarch added to give it that silky feel, as well as calcium phosphate to improve its flowing ability.  What they mean here, though, is that it is a much finer grain than their regular erythritol.  It is still a grain, however.  I buy it because it dissolves faster than the larger crystals, but both are good products."}
