{"Id":"83290","ProductId":"B005ZBZLT4","UserId":"A2LH2KYM4Q8TY4","ProfileName":"Paul","HelpfulnessNumerator":3,"HelpfulnessDenominator":4,"Score":4,"date":"2011-12-04","Summary":"Good Coffee, Different Packaging","text":"I love discovering and drinking a variety of different coffee's in the never ending quest for the perfect cup.  The K-Cup format makes the trek much easier and enjoyable with the guarantee of a fresh tasting cup every time, as opposed to coffee beans that can go stall plus the convenience of drinking something different with each single cup if I desire.<br /><br />The journey brought me to San Francisco Bay Coffee's Fog Chaser.  Having had the opportunity to travel I had experienced the the brand and was excited to see it \"available soon\" in K-Cups so I didn't hesitate to preorder.<br /><br />As I have come to rely on, Amazon delivered on time and I was anxious to try it the next morning.<br /><br />The Coffee (5 Stars)<br /><br />- Fog Chaser didn't fail to impress. In fact I would say it over delivered on quality based on my expectations - The rich full bodied taste and smooth finish made an excellent addition to my morning routine and I would highly recommend it.<br /><br />The Packaging (2 Stars)<br /><br />-  The K-Cupish like packaging, though innovative leaves room for improvement.  Instead of the traditional solid sealed K-Cup we have all grown use to the San Francisco Bay Coffee comes in a hybrid type packaging.  The coffee is held in a coffee filter material pouch that is attached to a K-Cup like top. It doesn't effect how you us it but it does effect a few other things.<br /><br />First off I seem to get more coffee grounds in my cup than I do with a traditional K-Cup.<br /><br />In addition the individual cups, because the coffee is exposed to air via the filter pouch freshness becomes an issue.  They come in the box sealed in an air tight bag but it is not resealable so once you open it the remaining coffee is exposed.  If this was the only coffee I drank it would probably not be an issue but because I jump around a lot it sits longer effecting the taste.  I guess I could place them in a resealable bag but call me lazy or cheap but I don't and feel I shouldn't have to.<br /><br />Lastly, though very nit-picky the individual cups will not sit in the coffee carousel I have on the counter next to the maker (you probably wouldn't want them to because of the freshness issue) but again it just makes it a little more inconvenient.<br /><br />As I drag myself into the kitchen after loosing the battle with my alarm clocks snooze button and I struggle in to make the first cup to get the caffeine flowing through my system I just don't like to work that hard at it.<br /><br />Summary<br /><br />- The packaging itself will probably not keep me from reordering but it will be much less often than I would normally with some of my other favorites.<br /><br />So with all that said, if the packaging doesn't bother you or effect long term freshness, you are in for a very nice cup of coffee."}
