{"Id":"496665","ProductId":"B005HG9ET0","UserId":"A3OJX18B60PJR9","ProfileName":"DAVERAT \"daverat\"","HelpfulnessNumerator":0,"HelpfulnessDenominator":0,"Score":5,"date":"2012-09-20","Summary":"Helps me get better results when baking but doesn't taste much different","text":"I ordered this to try primarily becuase I come from a part of the East Coast where our Tap water or Well water is naturally more Alkaline  than it is here in SOuthern CA.  For almost 20 years I've tried to make a decent crispy pizza crust or the right combination of tender on the inside, crsuty on the outside homemade breads.  I tried addiing things that should make the PH of my doughs more alkaline, hoping to reproduce the baking of my upbringing and yet.. I always failed.  Shortly before she died, an italian neighbor of mine from back east suggested I carry back some bottled water from our own well and save it just for bread baking.  well, after 9/11, you couldn't do that and it seemed all the bottled waters out here in CA tasted like sulfur and made my bread crusts tough.  The Good news is that I tried making several different types of bread using the Essentia and it DID seem to do the trick.  That may be a silly reason to buy bottled water but if you want to bake your great-grandmother's bread for the holidays, then what'sa few bottles of special water gonna hurt?<br /><br />As for taste?  It tasted fine to me - no better or worse than the best waters I've had. I can't say speak to the issue of GERD and acid reflux but if this water helps somebody with that, it's a lot better than getting hooked on Proton-pump inhibitor prescriptions that cause even more problems than they solve.  I read many of the reviews from people who were buying the Essentia for that reason and many of them seem to have found this water gives them more natural relief.  It's an interesting approach and one worth trying since the environmental impact and carbon footprint of relying for life on Prevacid or Nexium is far worse than simply swithing the bottled water you drink.  In a perfect world, we'd all toss our bottled water and use Tap filters but Essentia's Reverse Osmosis process followed by Ionic Separartion tech is a little bit.. no.. way above the cost reach of most home-owners.<br /><br />Me, I'll use my tap filter for drinking water but when I bake anything, I'll likely use Essentia as the water called for in the recipe because it most closely mimics the effect that the natural well water of my youth had on the baking process.  Water is not simply H20 - the minerals in it contribute to the outcome in cooking as does the pH.  Sure, I could just dump some extra baking soda in but that never worked in the past as well as Essentia has worked in my recent baking spree.  I'm a believer in it's chemcial differences vis a vis baking.  If helps some people reduce acid stomach without medication then they've found a unique way to help others.  You know how much a year's worth of Nexium costs?  Do the math and then you'll see my point.<br /><br />I don't think essentia will rock the world of bottled water but like Coconut water, caffiene water and even mint water, if it ain't HFCS soda, it's not as bad.  Sure, we should drink tap water but some people can't.  Until we all have Triple filtering technologies, there's Essentia."}
