{"Id":"240041","ProductId":"B001VJ0B0I","UserId":"A2OCDK0BOW6UCY","ProfileName":"Antigone Walsh","HelpfulnessNumerator":1,"HelpfulnessDenominator":1,"Score":3,"date":"2012-07-05","Summary":"Dogs Love It But Is It beneficial?","text":"My brother and I have an ongoing dispute about what is best to feed dogs.  I maintain, quality in will result in fewer illnesses and vet bills. My dogs usually eat Innova or Fromm.I rarely go to the vet for anything other than wellnes visits and shots. He thinks that the cheapest is fine. His dogs always have ear infections and are a bit on the pudgy side.<br /><br />Enter Beneful.  My brother thinks it is a high quality food brimming with meat and vegetables.  I was not so sure.  If you look at the bag, it would seem he was right but the ingredient list tells another story.  The primary ingredients are ground yellow corn, chicken by product meal, corn gluten meal, whole wheat flour and beef tallow.  Yes there is some real beef and much further down the list are carrots and peas. Not exactly the appetizing mix pictured on the bag.<br /><br />The kibble itself has a pleasing appearance.  With no discernible odor, it comes in a variety of shapes colors and textures.  The dogs love it, which is probably not a resounding endorsement as one of them will reguarly clean the cats litterbox if you are not careful.  But in fairness, they do gobble it with great enthusiasm and even try to open the bag to get seconds.<br /><br />The bag is one of the best things about this food.  It has a plastic slide zip which not only works smoothly but keeps the food fresh and safe from maruading pooches.  It is bright and colorful and the 15.5 pound size  is easy to handle.<br /><br />I guess in someways it is like letting your kids go to McDonald's.  An occasional meal won't kill them, but it is not good for everyday.  I will go back to my expensive premiums and use the remaining kibble as training bits.  My brother however, thinks it is great because all the dogs dive into it with unbridled enthusiasm and it is significantly less expensive.  For what it is worth I have a one year old Geraman shepherd and two 3 year old Chinese Cresteds.  He has a 6 year old shepherd, an 18 yr old schnoodle and a three year old chow mix.<br /><br />If you are concerned with convenience the packaging makes this product ideal.  However if you are seeking a high quality food for your pet, I would look elsewhere."}
