{"Id":"563076","ProductId":"B007JFMH8M","UserId":"A4JHEO7H330AF","ProfileName":"Tom Brody","HelpfulnessNumerator":1,"HelpfulnessDenominator":1,"Score":3,"date":"2012-09-08","Summary":"Bland, but great for older adults","text":"QUAKER SOFT BAKED OATMEAL COOKIES RAISINS is a product consisting of a box of six cookies.  Each of the six cookies is enclosed in a sturdy plastic envelope, with a tooth-edge at the top and bottom, suitable for grasping and for tearing open the envelope.  On the plus side, all of the cookies were intact, despite shipping.  The intact nature of the cookies was largely due to the fact that they are soft (not crunchy) and secondarily due to the secure packaging.  The cookies were bland and unadventuresome, both in taste and in texture.  Although the photographs on the cardboard box and on the plastic envelope show cookies having a surface dotted withabout 12 whole raisins, it was the case that the actual cookie contains a scattering of chopped raisin bits inside.  Therefore, the consumer should not expect to be treated to a cookies bearing a cargo of plump, juicy raisins.  In paying attention to the flavor, I noticed that the cookies had a detectable raisin flavor.  Also on the plus side, in knowing (from first-hand experience) that hard oatmeal can get wedged in between fillings, resulting in damage to teeth and fillings, the older consumer will be pleased that this QUAKER product is totally inocuous, as far as dental work is concerned.  These cookies are, indeed, sooooooft!<br /><br />Ordinary oatmeal has about 61 grams carbohydrate, 12 grams protein, and 7 grams fat, per 100 grams of oatmeal (Pomeranz (1987) Modern Cereal Science and Technology (pages 350-370)).  The NUTRITION FACTS label that this QUAKER product shows that the breakdown is as follows.  Each QUAKER cookie (42 grams) contains 27 grams carbohydrate, 6 grams of fat, and only 2 grams of protein.  Hence, it can be seen, that the cookies, as compared to straight oatmeal, is somewhat low in protein.  The low protein content should not be a concern to most adults, because growth, and the issue of acquiring the proper nutrient balance to sustain growth, is generally relevant only during pregnancy and lactation, and for growing children.  If any conclusion can be made regarding this fine product, is that it could be a preferred snack food for adults who have had multiple dental fillings, and need to worry about dental damage.  Although this cookie is fine for children, please remember that much better sources of protein are available, e.g., milk, cheese, meat, fish, poultry, tofu, and legumes (peas, beans, lentils)."}
