{"Id":"12780","ProductId":"B0030MNHEG","UserId":"AKBGBE9H1C0L6","ProfileName":"Tanooki-san","HelpfulnessNumerator":0,"HelpfulnessDenominator":0,"Score":4,"date":"2012-08-06","Summary":"Good Stuff","Text":"I saw this at my local Food 4 Less for less than $3 (5 oz.) and had to give it a try. I've seen this hot sauce online before but could never justify paying the high cost plus shipping so I thought $3 was actually pretty cheap. I was a little wary at first because when I looked at the ingredients to see what kind of peppers were used the first one listed was habanero. I'm not a fan of straight up habanero sauce. I've tried popular habanero hot sauces like El Yucateco and didn't like it. El Yucateco has a weird pungent smell to it that I can't get over and I find the taste somewhat off-putting. It's also too hot for me. But I saw on the label of Gringo Bandito that it uses a mix of various peppers so I figured it might be different.<br /><br />After tasting Gringo Bandito I was pleasantly surprised to find it doesn't taste the same as a regular habanero sauce. The smell is not sour or overpowering but rather has a nice spicy aroma. The combination of different peppers (habanero, jalapeno, red japanese chili, and more) seems to work well. It tastes good. It's got much more complexity than something like Tapatio. Tapatio's decent but has more of a vinegary taste to it. This is more balanced. It also has the perfect amount of medium heat to it; not weak and not too hot but still enough to give it a nice kick.<br /><br />So I like this stuff and recommend it wholeheartedly . I don't give it 5 stars because I don't love it like I do another hot sauce. My favorite hot sauce is the chile de arbol variety. The kind they give you at the taco shops that's orangish in color and comes in those round plastic containers. That's my absolute favorite but I haven't been able to find a good bottled version of it at the store. I would certainly keep buying this stuff though. Kudos to Dexter for creating a good hot sauce!"}
