{"Id":"9850","ProductId":"B000LR4HYW","UserId":"A2A1XYSB692L6J","ProfileName":"Patricia \"A Reader\"","HelpfulnessNumerator":1,"HelpfulnessDenominator":1,"Score":4,"date":"2011-05-10","Summary":"Y U M M Y...........B U T......I ' V E......T A S T E D.......B E T T E R","Text":"I waited quite a while before following my impuslse to buy SMOKED SALMON AND SPINACHE MOUSSE, manufactured by GOURMETFOODSTORE.  Of course, it's expensive, and I ahd to save up for it.  And it's quite caloric, as well.  However, the picture of this gourmet treat finally DID get to me, and...after returning to this picture and this product several time.....couldn't resist it any longer.  For me, it was my \"royal treat\", to celebrate the Royal Wedding of Prince William and Kate Middleton!<br /><br />Well, my package arrived a bit after the wedding, (today, actually) --but that's because I ordered it a bit after the wedding, (May 6, to be exact.)  I kept reminding myself how expensive this really is, and how even the Queen saves money whenever, and wherever, she can....but it was no good.  I had to at least TRY this stuff...at least once...<br /><br />The package, marked \"Perishable\", had stood out in my hallway for a few hours, as I was out this morning.  Upon opening the outer cardboard box, then the inner styrofoam box, (repleate with cold-bags, to keep the pershable food inside fresh),  I came across a small brown-cardboard box which held my Smoked Salmon Mousse.  Inside, was not one big package, as I had expected, but, instead -- to my delight -- sixt small black plastic tubs!  It seems, happily, that no matter how much you order of this Somoked Salmon Mousse, it will always be packed in these elegant little black plastic tubs.  The black contrasts nicely with the Smoked Salmon Mousse peeking through both sides of the large yellow label, that almost -- but not quite -- covers the food within.  The label says \"Terroirs d'Antan\" in big letterss, and I take it this means \"land\" of Antan, (and not \"terrors\" therefrom),<br />as \"terre\" means \"land\" in French.  Three ducks on one side and one rabbit on the other side of the central \"Terroir's d'Antan\" are \"inhabiting\" the yellow label, and we can see, in the far right distance, a huge building that looks like a French chateau -- and, indeed, right below this, in smaller letters, are the words,<br />\"The selection 'Terroirs d'Antan' revives ancient recipes from the vearious terroirs of France.  Enjoy.\"  But further down the label, it is revealed that the product was 'Made in USA - Distrib by Optimus, Inc., Miami Fl  33138.<br /><br />The larger box in which this individual serving, (actually, containing 3 servings -- 7 ounces), black plastic box came, described the contents as being \"Packed in Aspic\".  And so it is.  When the vaccum-packing, transparent plastic covering is removed, there still is another transparent layer to be removed.  My own experience with \"aspic\" had heretofore been, mainly, with learning of the title of a movie, \"A Dandy In Aspic\", starring the late, (and really great), Laurence Harvey.  I have yet to see the movie -- and have never, really, known what 'aspic' is, exceptthat it is some sort of foodstuff.  Well -- I discovered, upon taking what must be aspic off the top op of the salmon mousse, that it is similar to the temporary, plastic 'dots' that are sometimes used to keep products on cardboard backings, but are (somewhat) easily removed.  A type of transparent jello, actually -- about 1/8 inch thick.<br /><br />Well, finally I had the mousse in front of me, and it was time to eat it!<br /><br />The flavour was milder rhan I had expected -- perhaps because \"Cream Cheese\" is the first ingredient.  The smoked salmon flavour DOES come through, on occasion, and it is a nice, dark, smoked salmon flavour, indeed!  But there is far too little of this wonderfully rich smoked salmon flavour here.  (Maybe my taste buds came upon a \"pocket\" of the salmon that had not thoroughly mixed with the cream cheese.  In any event, this product should have been labled as \"Cream Cheese and Salmon Mousee\", because \"cream cheese\" is the first ingredient listed, and \"smoked salmon\" is the eighth ingredient listed, (out of 17 ingredients), and \"spinach\" is the fourteenth.  (This product was made in the USA, remember -- and if I remember correctly, ingredients here must be listed in descending order.  But -- does this<br />\"in size\" order apply to titles too?  If not, it should...<br /><br />The smoked salmon mousse has, again, a very MILD flavour.  it tastes very UNsimilar to the NY-type \"lox\" I had hoped it would.  Here, the amount of cream-cheese SO overwhelms the amount of smoked salmion, that it ALMOST tastes like exotically spiced, and flavoured, cream cheese!<br /><br />The little black \"tubs\", however, are definitely re-usable.  Of a size similar to restaurant trays for artificial sweetner, they are happily made of \"No. 5\" plastic.  According to an \"Organic Gardening\" article I read a while back, ONLY No. 5, or No. 6 plastic are safe to reuse.  So, these little black tubs can be used to hold sugar and artificial sweetener packets, stray coins, business cards, tea-bags, or any other similar object(s).  They can also be used as \"portion-control\" containers, as they hold not-too-much, and not-too-little of any food -- including, (for reference), about five rounded tablespoons of tuna spre<br />trays for<br /><br />\"Vita\" foods, (available in New York's Waldbaum's supermarkets, and probably other areas as well, sells a someked salmon and cream-cheese spread, at 8 ounces for under $3.  Ir does not have spinach, chives, eggs, tomato, or many of the other ingredients in this Smoked Salmon Mousse, sold by GourmetFoodStore. It comes in a white, round plastic tub.  As it has more smoked slamon in it, it tastes more like smoked salmon to me.  As it's kind of inconvenient for me to go to a land-based store, I certainly hope Amazon will offer this VITA product, and others, (like their herring in wine sauce), soon.  otherwise, I'll save up for, and load up on, this Vita product when next I go to Walbaum's.  The 'Smoked Salmon and Spinach Mousse Pate - All Natural,\" being reviewed here, DOES have more \"snob\" appeal, and DOES come with those nice little space-saving black tubs.  But, unlike the Vita smoked salmon and cream cheese spread, it has more smoked-salmon taste.  And that, when all is said and done, in the end, the main thing that matters in foods, doesn't it?<br /><br />P.S.  One More Plus:  The \"GourmetFoodStore\" catalogue which is included with every pruchase is an education in gourmet food, all by itself.  Did you know HOW MANY types of smoked salmon there are?  HOW many types of caviar?  Whether you buy anything (else) from \"GourmetFoodStore\", this catalogue is not only mouth-watering...but very educational!  Made on fine \"slick\" paper, and filled with beautiful cloured photos, (and also high gourmet-food prices), it is a \"gourmet\" catalogue in more ways than one!  Thanks, GourmetFoodStore!<br /><br />One More Minus:  Sadly, my food came packed in \"peanuts\".  No -- not the edible type of peanuts....the STYROFOAM type of peanuts!  It's impossible to open ANY package packed in styrofoam peanuts, without getting at least some of these innocuous-looking, but incredibly annoying little pieces of styrofoam, all over your floor! GourmetFoodStore is not the only manufacturer/ seller who does this of course....but one would think, with the wonderful, (and espensive) gourmet products they sell, that this up-market marketer would pack their food with something less annoying to the customer?  Of course, there IS the TINY advantage in having something packed in peanuts...one gets forced excercise picking up these small, but aggravating, strofoam peace-of-mind-destroyers, off the<br />floor.  OK -- a few calories are used in this way, and, if you are female, you can imagine yourself to be Ruth, (from the Bible), doing some gleaning.  However, I prefer to have MY fantasies when I desire to have them, and to excercise when _I_ decide to excercise, and NOT have these things suddenly and unexpexctedly forced upon me when opening up a package -- especially from such a luxury-goods emporium as GourmetFoodStore truly is.  Perhaps a $1 charge for having one's goods \"not to be packed in peanuts\" might be applied?  (PLEASE don't make it more than $1!)  Bubble-wrap and similar plastic space-fillers are SO appreciated by customer!  And less aggravation leads to less buying of calmatives and pain-relievers....possibly allowing for MORE money to be spent at GourmetFoodStore!  Please consider these \"suggestions for happier custumers\", dear GourmetFoodStore.  Thanks!"}
