{"Id":"485540","ProductId":"B001RVFERK","UserId":"A3A1OA237FOZFK","ProfileName":"#1 Amazon Fan","HelpfulnessNumerator":0,"HelpfulnessDenominator":0,"Score":5,"date":"2011-02-06","Summary":"Love them & I'm a picky eater","text":"I was a little hesitant to try these, especially after reading such mixed reviews although overall they were positive. However, I liked the idea that they are healthier than regular chips and I figured they would be great for school lunches, quick snacks, etc. I decided to give them a try and figured if we did not like them, they could be donated.  I ordered a mixed case the first time around to see which flavors we liked more (or less) and thought that would give us a good sampling.  After deciding we liked most of the flavors, we decided to try other ones as well.<br /><br />Despite the flavor preferences, these chips do not taste like cardboard.  At first taste, they are a little crunchier and thicker than you might expect. I think this is a good thing, because it means they are not heavily-laden with oil.  The 0.8 oz bags are 100 calories each as well, which is much better than the other alternatives and gives you the enjoyment of chips without the extra calories, trans fat, etc.<br /><br />I have included a summary of opinions below from myself, friends and family for each flavor:<br /><br />Sea Salt & Vinegar - Great, the absolute favorite flavor for everyone<br />BBQ - Very good, I'm not crazy about BBQ to begin with but would say this flavor is \"sweet\" BBQ. Everyone else loved them.<br />Cheddar - Very Good, probably close in preference to the BBQ<br />Original Potato - Good, but a little salty (seems to fluctuate somewhat between bags)<br />Salt & Pepper - Good, everyone liked them but preferred other flavors more<br />Parmesan Garlic - Good, but overall was 50/50. You definitely taste more parmesan than garlic and most people were expecting the latter.<br />Sour Cream & Onion - Not so good, no one really liked these enough to want more or to even finish the bag<br /><br />I know taste is a very subjective thing, but I hope this review helps someone decide to give these a try. I did get them at a reduced price through subscribe & save, and shortly after my first order, Amazon had them on the Gold Box for an even better price.  I think the average price per bag came out to approximately forty six cents a bag and had free shipping under my prime account."}
