{"Id":"13280","ProductId":"B00474HER2","UserId":"A33W8RH6ZXLOR0","ProfileName":"Moobs","HelpfulnessNumerator":4,"HelpfulnessDenominator":7,"Score":1,"date":"2012-08-06","Summary":"Ahh, the smell of horse shit conveniently sealed and preserved within a can...","Text":"I like pizza.  But regular pizza literally destroys my body (celiac disease and dairy allergy - yes, it does suck).  So my love of food has driven me to learn how to make decent versions of food I like which are gluten and dairy free.  I am now a MASTER pizza chef, to put it modestly.  Practically a PIZZA GOD.  I've got the pizza stone, the piel, found the best gf crust, the best df cheese, and the result is usually pretty great.<br /><br />ANYWAY...<br /><br />I like mushrooms on my pizza, specifically SLICED mushrooms, and I make pizza at home often enough that checking out at the grocery store with 20 or 30 cans of sliced mushrooms draws awkward stares.  The solution, of course, is to order in bulk via Amazon.  Have done this many times, trying out different brands, etc.  I'm almost certain I'd purchased this exact product in the past with no issues...but this latest shipment brought with it a harrowing ordeal involving smelly mushrooms and untopped pizzas.<br /><br />At first I thought I might have gotten a bad can, so I tossed the first stinky one.  Then the next one smelled just as bad.  Now - the smell isn't a rotten smell or an unnatural smell.  The best way I can describe it is a combination of normal canned mushroom smell and... horse shit.  If you don't know what horse shit smells like just imagine dog shit with a lot of hay and some mud mixed in.  So I stopped there and made my pizza without toppings.<br /><br />The next day or two when I made another pizza I decided maybe my sense of smell had been off before and to try opening another can of mushrooms from the same case.  Same fecal smell.  Even after extensive rinsing it smelled like I had been rinsing the mushrooms in an unflushed toilet bowl.  I had my wife smell the can (oh, she LOVES being asked to smell-check gross stuff...actually, no).  She agreed with the horse shit description.  I put the remaining cans back on a high shelf far out of sight.<br /><br />When next I went to the grocery store (actually, Target I think) I got a couple cans of Green Giant sliced mushrooms and later when I used them on a pizza they smelled totally normal and free of ungulate diarrhea.  You can see in the attached image how one of my normal pizzas comes out...with normal mushrooms.<br /><br />So I'm highly disappointed...and it's left me feeling unsure of any Giorgio mushroom cans...and unsure about any organic mushroom cans...and just about canned mushrooms in general.  I like to use fresh when I have them (like, as I write this)...but most of the time when I make a pizza I use canned shrooms.  But I feel deeply scarred by this turd-infused experience and may have trouble trusting any canned mushrooms for a while.  Which is definitely going to cramp my style pizza-wise.  LAME!<br /><br />(In case anyone is wondering, this is not a joke, even if it may be funny to laugh at my stinky mushroom ordeal.  I lived it and I have the battle scars to prove it.)"}
