{"Id":"14040","ProductId":"B0045XE32E","UserId":"A3A6GXILVT9JNW","ProfileName":"Jeanne Tassotto","HelpfulnessNumerator":1,"HelpfulnessDenominator":2,"Score":5,"date":"2011-03-17","Summary":"For the big dogs only","Text":"This is packaged in a resealable, air tight pouch which is easy to open.  The treats are thick and quite hard.  They are scored so they can be snapped in two, with a bit of effort.<br /><br />I called my canine food testing panel, Hunter - a four year old, 65 lb Golden Retriever, and Boston - a three year old 35 lb mixed breed.  Both members of the panel were called and appeared quite interested when the treat package was opened, although it must be noted that this is their usual response to any promise of food.  Each caught the treat when it was tossed and quickly gobbled it down, then stared at the bag waiting for a second sample.  After receiving treats for two days both panel members would return from the yard immediately when the bag was shaken and they were called - high praise indeed from this pair.<br /><br /> These treats are quite hard and did require that some chewing  occur rather than their usual practice of swallowing things whole which I considered a plus as it would help clean their teeth to some extent.  I do though question as to whether a small dog or one with diseased (or missing) teeth would be able to chew these treats.  To test this I offered these treats to my cats, and although both expressed interest in them neither were able to bite into the treats.<br /><br />I liked this product, both my dogs were happy with the treats (although to be fair neither one has ever been picky).  I was impressed that the ingredients were all natural and found the packaging quite convenient to use.  For my two dogs the hardness was a plus as it did make them chew even a bit rather than gulping whole.  I do not though think that this would be a good product to give a very young puppy, a small dog or one who had any dental problems as I do not think these animals would be able to safely break up the treats."}
