{"Id":"496667","ProductId":"B005HG9ET0","UserId":"A1LA4K5JF78BER","ProfileName":"Miyomoto Masaki \"MM\"","HelpfulnessNumerator":0,"HelpfulnessDenominator":0,"Score":4,"date":"2012-09-19","Summary":"All Water Is Not The Same IMO","text":"I have been drinking filtered water for many years. Ever since I was young I remember growing up drinking distilled water because my Uncle had sold my parents a distiller. Since then I have learned that the mineral content of the water is very important and also lends to a more smooth and refreshing drink. If any of you have tasted distilled water then you know what I mean.<br /><br />When I moved out and purchased my own house, I installed an R.O. filter under my kitchen sink and drank R.O. water for several years. R.O. water like distilled water has had most of the minerals removed during the filtration process. My local tap water has a pH of about 7.6 and a TDS (total dissolved solids) average of about 356 mS. My own R.O. water brought the conductivity down to around 30 mS and the pH to around 7 or slightly less. (I currently use my RO filter along with a de-ionizing filter afterwards to create ultra pure 0 mS TDS water for my Reef Tank) I do not drink it.<br /><br />I was introduced to \"Kangen\" or \"ionized alkaline water\" while I was traveling in Japan. It is water that has been filtered (usually thru a sediment, then a carbon block cartridge) and then run past energized Platinum plates to create 2 water streams. One stream is acidic and one is alkaline. The acid water can be used to clean, water plants and put topically on the skin amongst its many uses. The alkaline water is what you drink. Apparently during the ionizing process the water molecules are also altered. Usually water clusters together in 12 or so molecule clusters, while ionized water has smaller clusters of around 6-8 molecules. Supposedly this allows the water to cross the cell membranes in our bodies easier and promotes more rapid rehydration.<br /><br />Despite all the theories and studies, the real evidence for me is the way the water works for me. Before drinking alkaline water I would get heartburn or acid reflux occasionally after a long day of hard work or after eating certain foods. After several months of drinking alkaline water I never got acid reflux. Three years later since I first started drinking alkaline water I have only had acid reflux maybe twice. I would attribute that to the foods I ate that day and stressful work as well as not drinking the filtered water for several days prior. Alkaline water has improved my health in my opinion and am still drinking and prefer it to any other drinks when I am thirsty. It hasn't however kept me from getting sick occasionally or making me look many years younger. It has overall generally improved my health and I do feel better drinking it on a daily basis.<br /><br />Since I own a several thousand dollar alkaline water ionizer filter and drink the water daily. Own an R.O. filter and water testing equipment and understand a moderate amount of water chemistry principles. I was very curious to try this bottled version of alkaline water and see how it compares.<br /><br />It states on the label that the water has been R.O. filtered. Then minerals have been added back. It lists Sodium Bicarbonate, dipotassium phosphate, magnesium sulfate and calcium chloride. After the minerals have been added back then it is \"alkalized and restructured using Ionic Separation Technology. All of this sounds very familiar as this is exactly how alkaline water ionizers work. The water needs to have minerals added back to be able to ionize the water. Here is what I discovered after trying a bottle:<br /><br />Taste: I like the taste of it. It's not bad. It's light and refreshing and very similar to my own alkaline water.<br /><br />Smell: Clean. No noticeable \"off\" odors.<br /><br />Hydration Ability: Better than tap, but, \"nano-clustered\" water supposedly looses its smaller clustering formation over time measured in days. I wonder if the water is still structured the same by the time it gets to us to drink. Didn't seem to refresh quite as well as freshly made alkaline water.<br /><br />pH: Label states a pH of 9.5 which is on par with my ionizer unit which can produce a range of pH strengths from 7.0 to 12.0 I usually drink alkaline water with a pH of 9.<br /><br />Overall I like the water and would choose it first over any other bottled water at the connivence store. Its benefits would be the fact that it is filtered, has a proper mineral content (unlike distilled and RO water only), and has an alkaline pH. It's limitations to me seem to be the age of it thus potentially losing its small water clustering, as well as the plastic bottle is comes in. Many alkaline water aficionados recommend using glass containers first, stainless steel second and BPA free plastic third as the hierarchy of best water vessels to use. While not providing all the benefits of freshly made alkaline ionized water, it does provide a good many of them. Currently a 12 pack of 1.5L bottles on Amazon cost $28.75 and this translates to roughly $0.80 per 16 oz of water, which is not bad compared to $1.25 16 oz bottles at my local store. I think the 1.5 liter is a good size and a good quantity of water to drink per day of this water for most people. That amount to $2.40 per 1.5L bottle. I make my own for pennies on the dollar, but when including the initial investment of purchasing the ionizer along with replacement filter costs, buying these bottles will be cheaper for a long payback period. However if getting the absolute full benefits of alkaline ionized water is very important, you may want to consider purchasing an ionizing unit. These also would be a good way to test drinking this type of water before purchasing your own unit. In conclusion I think Essentia water is making a very good attempt to bring the benefits of alkaline ionized water to more people and I would purchase it over any other bottled waters."}
