{"Id":"5200","ProductId":"B003R0LKSG","UserId":"A3PDWI55HS4YH3","ProfileName":"Kari Skinner","HelpfulnessNumerator":"0","HelpfulnessDenominator":"0","Score":"5","date":"2011-04-18","Summary":"Super soft and healthy cat!","Text":"I adopted my adorable Edmund last year from a shelter. They sent me home with a small bag of Felidae (NOT grain free version) cat and kitten dry formula as he was a kitten at the time.<br />I am very concerned about eating healthy WHOLE foods, so I of course want the best for my kitty as well. I did research and found that cats' digestive systems are not designed to eat any grains/fruits/vegetables directly, and basically the only carbs they are to eat are what is already in their prey's stomachs (ie: if a mouse ate something carby and the cat ate the mouse they would get a little of whatever was in it). So I wanted to make sure the ratio of his food was as close to what's found in nature as possible, without breaking the bank.<br />He already seemed to really like the Felidae Grain-included version, so as soon as my starter bag ran out I immediately switched to the grain free variety and he has ONLY eaten this ever since I got him - he LOVES it!<br />I give him one small scoop of grain free kibble in the morning and then a partial can of this large 13oz Felidae grain free food (we've tried both the turkey/chicken and the salmon grain free canned ones and Edmund prefers the turkey/chicken but will eat anything I give him :-)). I bought some can lids at Petsmart, and they seal air tight on these cans - so fridge storage is clean and easy.<br /><br />He has the absolute SOFTEST, SHINIEST FUR COAT I have ever seen on a cat and he is very healthy and happy - we haven't had a single vet visit since I adopted him (even though he had chronic upper respiratory issues when I got him, they all cleared up). I have to blame at least SOME of all this on the fact he only eats grain free Felidae food (the rest is because I love him so ridiculously much!).<br /><br />I LOVE the FREE SHIPPING on Amazon (I buy a case of canned and a bag of dry (or two of one) at the same time)! I used to buy this elsewhere, and since it's so heavy shipping would often be almost as much as the product!"}
