{"Id":"240055","ProductId":"B001VJ0B0I","UserId":"A2DYMDOAJURO5F","ProfileName":"Aceto \"Hope is a Weed Exasperatus: 1:18\"","HelpfulnessNumerator":3,"HelpfulnessDenominator":4,"Score":2,"date":"2012-06-12","Summary":"Purina not molto Bene","text":"The triumph of marketing and finance over science and medicine is the theme of this ersatz dog food.  Have you ever seen a better dressed bag of dog food?  Snow White background with high tone graphics of floating ears of corn and amber grain just waving at you.<br /><br />Then, they were smart enough to have a really good reseal mechanism to open and close without a care.  No squeezing or stretching, struggling with those insane tracks you press together, sort of.  Beautiful.<br /><br />Open the bag and it is a riot of colors.  Better than anything Post or Kellogg can dish out.  And the doggie looks like the Quaker Oats guy.  This is genius.<br /><br />Smells like a bag of jumbo Fritos.  My 14 1/2 year old Corgi came sailing over my shoulder like a linebacker.  Okay girl, what do you think of this?  A cup and a half was gone quicker than you can say chicken by-product meal.  Say what? No, not chicken.  Just the by-product, made into \"meal\".  And that is only second in proportion.  The first is corn meal.  Third is corn gluten meal.  Then comes the wheat flour, followed by preserved animal fat.<br /><br />Why do we feed cattle corn?  Okay, yes, I know it is highly subsidized by tax dollars.  Besides that?  It makes them cows nice and fat on the cheap.  And what do Cattle produce, anybody?  Right, methane.  And now so does my dog.  There is probably no connection.  It might not even be mentioned in the other reviews; but please do not go by my review alone.  Excuse me while I open the window.  Maybe not quite enough calcium carbonate.<br /><br />On the other hand, there is propylene glycol and sugar both.  Yes that was the stuff added to Austrian dessert wine to make it sweet until they were caught.  You only see it in anti-freeze now (not to be confused with the more common ethylene) because the FDA has banned it in cat food.  And several sodium compounds.<br /><br />What bothers me most is that they knew how to do it right for us."}
