{"Id":"18950","ProductId":"B001AG9ZXG","UserId":"A2YM2NM7YZA24Q","ProfileName":"Haseeb","HelpfulnessNumerator":0,"HelpfulnessDenominator":2,"Score":3,"date":"2006-08-04","Summary":"it tastes good but it's hard to notice any difference","Text":"Years ago, when living on the east coast I suffered from asthma despite the fact that I was on four different medications.  After moving here to Arizona, I've been able to completely take myself off of all medications.  More recently however, my father passed away and apparently my emotional reaction triggered one of the worst asthma attacks I've had in years.  For the past two weeks, I've been gasping for air even after walking a short distance and could not even say a few words to people without gasping for air and panting.  My asthma became so bad this time that I contemplated going to the emergency room because I felt like I was going to pass out.  Instead what I did was do breathing exercises, bio-feedback, meditation and prayer.  While in the health food store I came across this tea, purchased it and staggered home to prepare it.  After drinking some, I noticed a little difference in breathing after about 30 minutes.  But I was thinking that it may not be the tea but simply because I sat down and relaxed for a while.  After drinking 3 or 4 cups of this tea a day using two tea bags, I honestly did not notice any significant difference in breathing.  The only thing significantly different was the fact that I started coughing up more flim, but that just could be that the asthma attack was running its course or the fact that I was drinking more fluids.<br /><br />The tea definately tastes good.  It has slight mint flavor which cools your mouth when the air is drawn in.  There is also a slight sweet and pleasant bitter taste to it.<br /><br />I quickly finished up two boxes of this tea.  I may buy some more later because I really like the taste.  As far as it treating asthma and other respiratory problems, it was simply hard to tell.  IF YOU ARE HAVING AN ASTHMA ATTACK, THIS TEA WILL NOT RESTORE FREE BREATHING.<br /><br />Only a few days ago, my asthma has been dramatically clearing up.  I worked out yesterday and am able to do strenuous exercise without panting and wheezing like I was doing last week.  I very seriously doubt that the tea had a delayed effect.  Last week, I didn't want to do it but I staggered into a drug store and purchased an inhaler (I hate using those things because they contain epinephrine).  I had two choices, either I keep suffering and kill myself or restore my breathing."}
