{"Id":"10550","ProductId":"B000LKXG8W","UserId":"A2A8E70X0VXJT0","ProfileName":"Kelly Howard","HelpfulnessNumerator":1,"HelpfulnessDenominator":2,"Score":5,"date":"2010-12-06","Summary":"Great, as long as you completely forget about cheese!","Text":"The first time I tried this, I thought it was beyond hideous. I was expecting something that tasted vaguely like pasta with cheese sauce. I had only recently developed a total dairy intolerance on top of the gluten problem, so was having very bad experiences with \"cheez\" & cheese subsitutes. Every one I've tried has been uniformly hideous, so it's not like I had high hopes for this dish. It is not even remotely cheese-like (or even \"cheez-like\"), and hoping for something that tastes within screaming distance of cheese messes up one's expectations something awful. However, I found if I approach this dish after erasing all thoughts of 'cheesishness' from my mind & tastebuds, it's quite good. Actually describing the taste is a bit of a challenge...it's got tons of flavor, not hot-spicy but turmeric/onion/garlic/paprica/butterish/something... maybe it's the hemp seed that gives it the indescribable yumminess I can't begin to compare with anything I'm familiar with. Whatever the heck it is, I find myself madly craving it quite often.<br /><br />As it comes out of the package, it's not creamy at all , though one can up the creaminess by adding whatever milk substitute you prefer, & I've also added 'fake cream cheese' to it with decent creamy results.<br /><br />Still, I wish they'd get rid of the 'cheeselike' claims & call it something else; it seems to me it'd better prepare folks for liking it, thus increasing the sales, thus BRINGING DOWN THE PRICE, which is my main complaint with this & all the Namaste foods. I really feel like too often those of us with real, severe, dietary restrictions --who have no choice in a specialty diet as opposed to those who are \"going gluten free\" as a way of jumping on a fad bandwagon-- are being budgetarily scr....er, shafted by specialty food makers.<br /><br />If anyone has been introduced to Cincinnati chili as an adult without adequate prior preparation, the shock experience of this pasta mix is something akin to that. I grew up on Cinci chili & have a lifelong addiction, but if you approach it expecting something like good ole texas chili with meat 'n' tomato 'n' beans, your taste buds are in for one heckuva shock. Those with no preconceived notions frequently love the stuff, but it is very, very different from traditional chili, having been concocted by Greeks."}
