{"Id":"10570","ProductId":"B000PSNJXC","UserId":"A1YUL9PCJR3JTY","ProfileName":"O. Brown \"Ms. O. Khannah-Brown\"","HelpfulnessNumerator":1,"HelpfulnessDenominator":1,"Score":5,"date":"2007-09-26","Summary":"Romantic, Natural, Unique Tea Experience","Text":"*****<br />White Rose Velvet Garden White Tea is an exciting and unusual premium Numi tea. It is a white tea, more rare than other types of teas and less processed as well, having been only plucked and dried (not oxidized). Some people find white tea a subtler and more enjoyable type of tea experience (I know I do). White Rose Velvet Garden White Tea is certified organic, and is both fair trade and kosher.<br /><br />It is made from hand-wrapped white tea leaves and rosebuds! Rosebuds---can you imagine?!?! Those are the only two ingredients, and they are delicate and delicious, different from anything else I've ever tried. This Amazon page erroneously lists some other ingredients but these are absolutely NOT in this tea---it is made from only white tea and roses.<br /><br />This tea, like all Numi teas, is packaged with 100% post-consumer waste, and the tea bags are made from biodegradable filter paper. Numi does not believe in the practice of adding oils or flavorings to bolster flavors, and I love this and can tell the difference; for this and many other reasons, Numi is one of my favorite tea manufacturers.<br /><br />On the box, Numi writes: \"Roses have been a symbol of love and beauty since the dawn of romance. Numi's enchanting Velvet Garden(tm) releases a provocative sweet rosy taste as it blushes a soft pink. With every sip this liaison of organic rose petals and delicate Spring White tea imparts a silken smoothness. White Tea is the tender bud of the tea plant making it exquisitely subtle and supremely healthy. High in antioxidants and vitamin C, this uplifting Fair Trade Certified white tea blend will be the beginning of a long lasting love affair.\" I have to agree. This is truly an amazing tea.<br /><br />If you like Numi teas, get it---you won't be sorry. If you are new to Numi but love white tea, or are curious to try it from the description, I do not think you could find a better source than Numi. If you are looking for a romantic tea, White Rose Velvet Garden White Tea fits the bill perfectly.<br /><br />Highly recommended.<br />*****"}
