{"Id":"19150","ProductId":"B002YR7B90","UserId":"A2IAYGGXNMS4J0","ProfileName":"S. Roach \"bookivore\"","HelpfulnessNumerator":1,"HelpfulnessDenominator":1,"Score":5,"date":"2011-07-30","Summary":"An excellent fiber-rich gluten free flour blend","Text":"This blended flour is wonderful for those on a GF diet and works well in baked goods, giving a richness without excessive coconut flavor. To determine if this product is right for you, it is important to consider how you plan to use it.  If you are looking to add a little fiber to smoothies or sauces or soups, you may want 100% coconut flour. If you are wanting it for flavorful baked goods recipes with fiber, this should work perfectly! If you are making your own flour blend and wanting a flour that will not effect blood sugar so much, this is not what you need.<br /><br />If you read the reviews elsewhere on Amazon for pure 100% coconut flours--which this product is not--you will find some users were expecting the benefits of coconut flour with the ease of all-purpose wheat flour. There are good reasons for blending other flours with coconut flour:coconut flour alone can be difficult and expensive to use because it requires a lot of liquid--usually in the form of eggs and oils--to make a recipe work properly. This product \"Gluten Free Mama, Mama's Coconut Blend Flour\" has solved some of that problem by blending in other flours.  If you are trying to avoid carbs, this likely is not the flour for you. HOWEVER, if like me you are trying to avoid gluten while also adding fiber in your diet, this may be exactly what you seek. Note again, this is a blend of several flours, so if you did not catch the word \"blend\" in the description above as some reviewers did not, take note. Each of the flours in the blend brings something to the table, but if you seek the benefits of 100% coconut flour, look elsewhere on Amazon--but before purchasing it do read the reviews from people who expected it to work like all-purpose flour in their baking. (Most of the poor reviews for both products are not the fault of the product but of the purchasers.)"}
