{"Id":"13970","ProductId":"B000793XK8","UserId":"A2N96A168YW2C3","ProfileName":"Kate H","HelpfulnessNumerator":2,"HelpfulnessDenominator":3,"Score":5,"date":"2010-11-27","Summary":"By far the best truffle oil available","Text":"I've read a whole lot of reviews for the various different brands of truffle oil, a number of which suggest that there is no way of infusing truffle flavor into the oil, and that all are full of chemicals.  Well, I can't comment knowledgeably on that, but I can say that the Bartolini brand is by far the best that we have tried, and tastes and smells strongly of truffle.  We use this primarily as a finishing oil, on risotto and scrambled eggs, where the quality of the underlying oil is critical, and have been really happy with the Bartolini oil.  I first used this product when living in London, and had friends bring some out for me when I hadn't been able to find a good alternative in the US, so am delighted to find this on Amazon.<br /><br />The oil is a bright yellow, and the base oil smells like a good quality extra virgin oil.  Each bottle at least has a small piece of truffle in the bottom, lending some support at least to the idea that the oil is infused.  If there is artificial flavor added, as some reviewers have suggested there has to be, then all I can say is that the resulting taste certainly doesn't have a chemical, or artificial taint, unlike some other brands we have tried.<br /><br />In particular, we have also used the Tourangelle brand, available in a tin from Amazon and Whole Foods, which is absolutely ghastly, and the quality of the oil used for that brand is appalling.  The end product is pale, tasteless and almost without any aroma, let alone that of truffles.  The presentation in a tin is unattractive and also lends the oil a somewhat metallic taint...just a generally awful product.  I guess they realize that the product looks so bad that if they put it in glass they'd never sell any of it.  Perhaps they think people are going to use it as a cooking, rather than a finishing oil, which is completely inappropriate....you could hope that heating it may burn off the dreadful chemical taint!<br /><br />So, if you're looking for a good option, that looks and smells good on the food, and at least gives the impression that it is a natural oil, I don't think you can go past this product."}
