{"Id":"4110","ProductId":"B001EW5YQS","UserId":"A1QM68NKDJC2Z7","ProfileName":"D. Gordon","HelpfulnessNumerator":0,"HelpfulnessDenominator":0,"Score":1,"date":"2012-09-14","Summary":"Blue Icicle - does not work with Windows 7!","Text":"I have been using a standard XLR to USB cable with my Shure 58 dynamic mic, which works okay, except for an annoying hissing noise that accompanies the majority of my vocal recordings.  I bought the Icicle in hopes of eliminating those noise issues.<br /><br />When I received the Icicle, I couldn't wait to plug it in and take it for a \"test\" drive. Unfortunately, right off, I got an error - unable to load drivers.  This is a plug and play device, so there are no drivers to download, and I knew something wasn't right. After 3 restarts and uninstalling the USB Hubs and ports numerous times, as suggested by Icicle's troubleshooting website, it was still a no go.  I went to Icicle's website and logged a ticket, explaining the issues in detail and that I was running Windows 7.  The next day, I received an email instructing me to send the Icicle back, as it has a defective driver.  Amazon was GREAT about sending a replacement while the return was on its way.<br /><br />So, I received the replacement Icicle today, pulled it out of its packaging and with bated breath, plugged it in, hoping for success. No such luck - the same error message came up about the drivers. I decided to Google my issue:  \"Icicle compatibility with Windows 7\", and Bam!, it took me to a Guitar Center review of the Icicle that CLEARLY shows in the product specifications that it is NOT compatible with Windows 7.<br /><br />Amazon needs to get on the ball and add this to their information.  It is nowhere in Amazon's description and the Icicle \"techs\" themselves didn't have a clue about it either. I found this inadequacy with the blue mic technical team to be unacceptable.  They probably have non-technical CSRs pretending to be techs for all their troubleshooting. That's one way to save a dime, but please people - if you're going to give us \"technical support\", then say so.  If it isn't really technical support, then say it is Customer Service.<br /><br />I am terribly disappointed that this device has not been upgraded to accommodate the newer technologies.  Windows 7 has been out for some time now.  There is no indication in the little mini booklet that comes in the Icicle package that says Windows 7 is incompatible -it only gives set-up info for Mac and Windows (does not show which OS).  I am sending my Icicle back to Amazon for a refund and will need to look for something that WILL work with Windows 7.<br /><br />If you have a PC that was purchased in 2011 or later, save yourself the hassle and don't bother with this product, as your OS will more than likely be Windows 7."}
