{"Id":"240079","ProductId":"B001VJ0B0I","UserId":"A1UMSB7LAW0RIR","ProfileName":"Writer of Books - Mage - Mom to Two \"Writer, ...","HelpfulnessNumerator":2,"HelpfulnessDenominator":3,"Score":4,"date":"2012-07-25","Summary":"Dogs love it, picture on bag is very misleading.","Text":"I have a huge dog and a wee beagle. I won't lie, they would eat anything and have tried. (Well, they won't eat cucumber peelings if they drop on the floor. Weird.) I served them Beneful and they woofed it down, no problem. :)  I do believe that the bag picture and name are misleading, as well as the ad campaign for this dog food. It's not very beneficial for your dog and the top ingredients are total junk and filler. I prefer <a href=\"http://www.amazon.com/gp/product/B0009X63VS\">Chicken Soup for the Dog Lover's Soul Dry Dog Food for Senior Dog, Chicken Flavor, 35 Pound Bag</a> but it's way, way more expensive. With Beneful, you are going to see a LOT of waste, so to speak, when your dog `goes for a walk'. There is a belief that if you feed your dog good, quality food, there is less waste because there is so much nutrition being gleaned from the food. I'd say this is true, but not so much less waste that you can..oh...get another dog, or take smaller poo-bags on your walks. (hahaha) This food is more like, homemade play dough. If you took homemade play dough, which is mostly salt, and shaped it into the form of a carrot and a chunk of steak, then ate it, you would still be eating salt, not meat or veggies. Beneful looks like food, but it's mostly junk. Why the four stars? Because I've been feeding my dogs cheap food all their lives, and fed the same kind of food to my passed-on dogs and they all did fine. They all lived to their life's expectancy and beyond. No health issues, ever (except for a dog-ate-a-corncob-incident, which if you think about it, I would not have had with just kibble!) and they had/have energy, healthy teeth, coats that shine etc. Overall, if you can afford better food, I say go for it."}
