{"Id":"496715","ProductId":"B005HG9ET0","UserId":"A1TR1R2QKWRSRA","ProfileName":"D. Chou","HelpfulnessNumerator":0,"HelpfulnessDenominator":0,"Score":3,"date":"2012-09-07","Summary":"About the same as normal filtered water.","Text":"There are wide selections of bottled drinking waters available.  This current trend of high pH water claims many \"healthful benefits including being a natural antioxidant, flushes out toxins and neutralizes acidity in the body, more hydrating than conventional water, etc.\" from online health and nutrition websites.  Let's give this Essentia 9.5 pH drinking water a try.<br /><br />Likes:<br />>Decent taste; similar to my home water filter system with the <a href=\"http://www.amazon.com/gp/product/B002YOQ0C2\">Watts Premier 531105 RO-Pure Annual Filter Pack</a> that also uses reverse osmosis purification.<br />>I drank the sample 1.5 liter bottle for two evenings during my after-work workouts and didn't notice any improvements in performance but it did quench my thirst very well and seemed to have shortened recovery time with less sore muscles (perhaps from some lactic acid buffering properties AFTER the workouts).<br /><br />Dislikes:<br />>I appreciate this sample but the cost of Approx. $5 for each 1.5 liter bottle is very high.  My Ro-Pure system filters the same amount of water for far less.<br />>Healthful benefits are only claims and not proven through scientific studies with proper clinical research methodologies.  It's difficult to draw conclusions by just drinking 1.5 liters.<br />>Possible long term effects of high pH drinking water with ingredients of sodium bicarbonate (baking soda), dipotassium phosphate, magnesium sulfate, and calcium chloride (salts/electrolytes).<br /><br />Overall:<br />Overpriced \"trendy\" drinking water that tastes about the same as home reverse osmosis filtered water.  Claims of high pH water health benefits questionable.  Works OK as regular drinking water but doesn't improve performance during workouts."}
