{"Id":"180899","ProductId":"B007Y59HVM","UserId":"A20XKFP1MCCBOQ","ProfileName":"Jeffery K. Hilburger \"Keurig Jockey\"","HelpfulnessNumerator":125,"HelpfulnessDenominator":137,"Score":5,"date":"2011-11-17","Summary":"Great morning wakeup cup of coffee","text":"These Keurig compatible onecups are a cross breed design resembling a Kcup top with a pod body.<br />They come 12 servings sealed in a vacuum bag with freshness seal. This is then placed in a attractive retail type box<br />that would look right at home on the shelf next to kcups at your favorite retail store.<br />The front of the Box has a drawing of a kcup machine and a blow up of the 1 cup inserted in it.<br />It also lists a few of the compatible keurig type brewers it will work in.<br />The top and back of the box has some photos of environmental projects that the Rogers Family has been involved in.<br />one side has a photo of the rodgers family and their mission statement. The other side has a description of the coffee contained in the box.<br />I can see how these should sell well in the retail setting and also appeal to environment conscious individual and those who are just curious about a new alternative to the standard kcup.<br />I have a Box of Fog Chaser described on the box as a blend with the body of our regular roast and the smokiness of our French roast. A heavy full bodied with hints of cedar,vanilla and toasted almonds<br />balanced with a delicate finish with honey and milk chocolate flavors. Sure sounds appealing to me.<br />When I cut the seal on bag I'm hit with a very strong dark roast scent right away and something poignant but can't place the smell. Maybe it's the ceder they describe on the box and I'm intrigued to brew and try it.<br />Fits in my B70 perfectly and I use the 7.25 oz drop as I normally do. Smells good during brewing just like the extra bold dark roast Kcups I normally drink.<br />Brewed perfectly with no issues. Smells and tastes great in the Cup. Strong full bodied french roast with a smooth finish and I like it as does the wife.<br />I'm not one to name flavors and stuff like that so you will have to try it yourself for a more specific taste profile. Suffice it to say I give Fog Chaser a Big thumbs."}
