{"Id":"13200","ProductId":"B002TMV34E","UserId":"A1SB9BNNGKNX2Z","ProfileName":"Jim","HelpfulnessNumerator":0,"HelpfulnessDenominator":0,"Score":5,"date":"2010-06-23","Summary":"Makes a darn good cup of joe.*","Text":"Classique Supreme is the second of the Melitta Gourmet Coffee Cafe Collection coffees I've tried. (I received free samples for review of the Classique Supreme and the Hazlenut Creme Brulee.) And I am quite pleasantly surprised.<br /><br />My coffee of choice to date, which I've been drinking for around 2 decades, is Peet's (which I get shipped to me as there are no Peet's outlets near me). Peet's sells several varieties which I like, and I always buy whole beans and grind them to make a cup at a time via a cone filter. When making coffee for 2 or 3 people I make each cup separately (using 2 or 3 cone filters at once). Also, I never drink straight coffee but always sweeten it (usually with honey) and add half & half (and sometimes French Vanilla International Delight).<br /><br />Melitta's Classique Supreme, as well as the Hazelnut Creme Brulee in the same line (and I assume all the varieties in their Cafe Collection line) are ground \"Extra Fine,\" and look to me to be finely ground enough to be used in an espresso maker (though I only make espresso - which I use in homemade lattes - with unflavored dark roasted coffees and the Classique Supreme is a medium roast). It looks and feels too finely ground to be used in a French Press (which I occasionally use for preparing coffee made from freshly ground beans, ground relatively coarse).<br /><br />So for testing/sampling purposes, I've been preparing the Classique Supreme (which I've drank several cups of over a couple of days) in a filter cone, using the exact measurements I use when preparing ground Peet's beans. And once I have sweetened and creamed the coffee to my taste, I cannot detect a difference in quality. The only difference I have noticed is that both varieties of Melitta's Cafe Collection that I've sampled leave me with less of an intense caffeine buzz than I typically get from the same size cup of Peet's (whether it's a medium or dark roast variety of Peet's). That's not necessarily a bad thing, for sometimes my second cup of coffee of the day (I usually drink 2 TALL cups a day) leaves me feeling a bit over-caffeinated (e.g., headachey or just off-kilter).<br /><br />The bottom line is that I like this coffee and given the relatively low price (e.g., at Amazon as well as Melitta's website), I'm motivated to try other varieties in Melitta's Cafe Collection line (particularly their darker roasts).<br /><br />I had difficulty opening both 11 oz. sample bags of Melitta Cafe Collection coffee I received - I found it impossible to open either bag without tearing holes in the upper half of each bag - so I called Melitta to comment about this. The customer service representative I spoke with said that Melitta recommends using scissors along the top of the bag.<br /><br />*(The phrase \"cup of joe\" supposedly came into vogue after Secretary of the Navy under Woodrow Wilson, Josephus Daniels, banned alcohol aboard navy vessels in 1914, leaving coffee the strongest drink on navy ships.)"}
