{"Id":"268774","ProductId":"B004SRFYMK","UserId":"A1VFENCO558LY","ProfileName":"Meredith Hopkins","HelpfulnessNumerator":15,"HelpfulnessDenominator":17,"Score":5,"date":"2011-08-25","Summary":"I Thought I Hated Coconut Water (Until Zico Chocolate!)","Text":"Having heard many people express their undying love for coconut water, last year I decided to try some. After about the first sip of the plain unadulterated coconut water I got at the grocery store I knew it and I were not going to be friends. I couldn't even force myself to finish the carton. I could not figure out why everyone was so excited about it and decided it just wasn't for me. Then, one day earlier this month I saw Zico Chocolate in the cold case at a convenience store, sandwiched between juices and sports drinks. I was hesitant to buy it considering my previous experience with coconut water but the lure of chocolate was too much. I am so glad that I decided to go for it! Zico Chocolate could not be more different from plain coconut water. The weird (almost like bad molasses) flavor I found so unappealing in the plain was missing completely from the Zico Chocolate. Because they added some coconut cream it is ever so mildly creamy and the chocolate is nice and rich like semisweet dark chocolate. Just like plain coconut water it has an enticing naturally occurring nutrient content including some calcium, magnesium, potassium, iron, vitamin A, and phosphorus. The only nutritional downside is that there is some added sugar, bringing the total sugar for one 14 oz bottle up to 18 grams. However, for me drinking a Zico Chocolate is often a replacement for either a dessert or a sweetened iced tea so I'm not really ingesting any more sugar than I normally would be. If you don't mind the added sugar and/or haven't been pleased with the taste of other coconut water I highly recommend trying Zico Chocolate.<br /><br />This last bit is about buying from Amazon and not about the product itself. This is the first time I've bought this particular product from Amazon and I am very happy with the purchase. It cost me significantly less per bottle to have it shipped by the case from Amazon using subscribe & save than it costs to buy in any store near me ($.75 - $1.00 less per bottle). Although buying it this way made it ineligible for Prime 2-day shipping, the box still arrived here the day after I ordered it and in perfect condition; that is good customer service!!!"}
