{"Id":"9590","ProductId":"B002PO09MS","UserId":"A3R7ATFBOPRY9F","ProfileName":"Dolly111","HelpfulnessNumerator":6,"HelpfulnessDenominator":7,"Score":3,"date":"2011-04-03","Summary":"Not as good as I initially thought","Text":"Love this stuff, very easy to work with and reasonably priced if you can manage to buy it through Amazon with thier subscribe and save program, otherwise it is pretty expensive and you are better off making your own MMF. The Wilton stuff is like rubber and hard to roll out thin enough. I had no trouble with this. It also was not too sticky which was the problem I ran into when I used the Duff product from Michaels. So far this is the best fondant I have used. It really doesn't dry out so if you want your pieces to stiffen up quickly or become completely hard you will need to mix in gumtex, tylose or gumpaste to accomplish that. I love the taste of this fondant too, I don't usually like fondant icings but this one is really good! The white is truely white too, not cream or antique at all so you can easily mix in other colors to tint the color you want.<br /><br />UPDATE 1/6/12<br />Lowering my stars from 5 to 3...<br />My first few batches of Fondarific were great, easy to work with, good taste, nice consistency etc. I use alot of fondant and have pretty much used every brand out there plus made my own. I was totally sold on Fondarific until my last couple of orders. I didn't feel like dying fondant so I purchased the colored Fondarific for the first time(Pink and Red) so I'm not sure if that was the problem but they were REALLY soft. Like another reviewer I ended spending an extra 3 hours or so to cover my cake and decorate it because I had to keep putting the stuff in the freezer and it tore and bubbled all over the place. It was ridiculous like working with melting taffy. I live in Washington state and it was October so humidity was definitely not the problem. My last batch of white was workable but also stickier than usual so pieces kept sticking to the mat (even with cornstarch or shortening). So far both batches of black that I purchased were great and didn't have these issues. I have to agree with other reviewers here that the consistancy is lacking with this product. If you get a good batch it is the BEST stuff out there but you have to cross your fingers and hope luck is with you. I may give them one more shot since my first few orders of white were perfect but I will probably also make some marshmellow fondant just in case they aren't up to snuff."}
