{"Id":"16980","ProductId":"B003XUJ564","UserId":"A2C9XE9I8RSKNX","ProfileName":"J. Johnson","HelpfulnessNumerator":4,"HelpfulnessDenominator":4,"Score":4,"date":"2012-08-17","Summary":"Pretty good flavor !  Great price !","Text":"After reading all of the dented can reviews, I wasn't sure what to expect. I did get 3 dented cans out of the 12- one was a mild ding, one was fair, and one was such that if I'd been picking it out at the grocery store, I would have looked for a different one- I just ate that one first.  Oddly, they were cans that came from the MIDDLE of the case- so something that happened at the manufacturer- NOT Amazon.  The cardboard tray was unscathed.  ConAgra needs to  do a quality control check on their can dinging area.<br /><br />Anyway, the flavor is pretty good. The first bite wasn't impressive, but since I'm on a fixed income, I only throw away stuff that is about to make me hurl, so I kept eating it.  It got better, and I am glad I got the product.  There were 7 ravioli in the whole can. That is a bit skimpy, but since it was going to be the only thing I had, I ate the whole can and was quite satisfied.  The sauce is much more flavorful than the Chef-Boyardee regular beef ravioli that I had as a kid, and tastes more Italian.<br /><br />The WHOLE can has 480 calories, 10 gms of fat, 78 gms of carbs, and 18 gms of protein.  There are also 10 gms of fiber in the whole can.  The serving size says that  the can is about 2 servings.  Hmm.... maybe for a young kid, or if there was a good salad, and fruit on the side, but I have too much pain to make full meals.  I have to make do.  There are 1 1/2 cups of vegetables per can- so that's good.<br /><br />No preservatives or MSG.  Unfortunately, it probably contains GMO sources of soy and wheat.<br /><br />I originally got these to have on hand for power outages, as I have a gas oven and could heat this up.  The expiration date is for 2 years from now, so that's good.  I can keep them in the pantry for such occasions, but can also see being fine with eating them on days when it's just too hard to come up with anything else."}
