{"Id":"563077","ProductId":"B007JFMH8M","UserId":"A20VX7F4164FVC","ProfileName":"Machael Foegelle \"xenagrrl2000\"","HelpfulnessNumerator":1,"HelpfulnessDenominator":1,"Score":4,"date":"2012-08-28","Summary":"Surprisingly good cookie!","text":"I love homemade oatmeal raisin cookies, the kind that are a little chewy, made with lots of oats, brown sugar, cinnamon, and not too many raisins.  So I was skeptical of this soft, \"store bought\" cookie.  I assumed it would be, well, bad.  I was pleasantly surprised.  It's made with whole grains, which imbues each cookie with 16% of daily fiber recommendations.  It was indeed soft, but it didn't seem artificially so, more like it was just cooled down from the oven.<br /><br />As I began my 'taste test', I appreciated the fact that the cookies are individually wrapped, which allows for easy transport in lunches or purses.  I took a small bite at first, because I was already prepared to be disappointed.  As that bite went down, I reached for another.  Then another.  Very tasty, as it turned out!  Soon the cookie was gone and I realized I wanted another one!  However, at 170 calories each, these are NOT \"low calorie\", they're just made with better ingredients than most.<br /><br />As for other nutrition information (other than the fiber and calorie count mentioned above), each cookie has 150 milligrams of sodium, so not too bad there.  You'll find 4% of calcium and 8% of iron (recommended daily requirements).<br /><br />The first ingredient is whole grain oat flour.  Sugar is about number 10 or so on the ingredient list.  One quibble I have is that the list of ingredients is rather lengthy.  My nutritionist has advised me to watch for products with what seem like extraordinarily long ingredient lists, probably means there's lots of stuff in there that's not exactly \"good\" for us, but it is what it is:  a factory-made, store-bought cookie that's got a pretty long list of ingredients and shelf life that don't come naturally to \"homemade cookies\".  Just accept it for what it is, a decent, convenient mass-produced cookie."}
