{"Id":"9370","ProductId":"B006N3IG4K","UserId":"A25SQ33WVST1HV","ProfileName":"Brant L. Rusch","HelpfulnessNumerator":"0","HelpfulnessDenominator":"1","Score":"2","date":"2012-01-28","Summary":"Not a fan of this blend","Text":"Coffee is a very subjective thing.  Some people like coffee that borders on tea, others like the stuff that a certain national chain named after a famous Battlestar Galactica pilot serves.  For the record, I love the slightly-sour taste of Dunkin Donuts coffee and I find the stuff made by \"that other chain\" to be akin to re-hydrated cigarette ash.  For many years, we still percolated coffee...with most big-name brands of pre-ground coffee, you needed a percolator to bring out the flavor in it, but again, your tastes may vary.<br /><br />With my Keurig, my favorite coffee was Paul Neumans Extra Bold....because it didn't seem Extra Bold.  Until you buy 80 of them and get tired of the flavor.  Then, my favorites were the Caribu's....but something happened to that brand (see reviews) and I agree, they did something...either they don't put as much in the cups or they changed the blend, the sourcing of the beans, etc......wasted money on Caribu and wont go back to the brand.<br /><br />So Wolfgang Puck got the nod, tried 4 different flavors.  This one, Sorrento, is not my favorite of the bunch (currently Colombian Chef's Reserve).  It has a bolder strength (which I believe hard core coffee drinkers would consider Medium), but to me it has a simple burnt flavor to it.  Cream and Sweetener don't correct for this, and thus I'm a bit disappointed....but again it was a stab in the dark.<br /><br />I think if you prefer a slightly bolder, slightly more burnt flavor in your coffee...this may be for you.  I like the character of the Colombian Chef's Reserve, but it is not as strong, and perhaps that is just what my taste is slanted towards.  I don't believe you can get a bad cup of coffee in the Wolfgang Puck line however.  Can't say the same for some other K-cup brands."}
