{"Id":"20420","ProductId":"B001BDDTB2","UserId":"A1ZM846Y7AUYD","ProfileName":"M. Pickering","HelpfulnessNumerator":3,"HelpfulnessDenominator":3,"Score":4,"date":"2008-12-02","Summary":"Healthy Feline Cuisine For Your Finicky Cat(s)","Text":"Most people know that cats can be finicky eaters.  They devour some food and simply walk away from others.  I guess that is one trait that I find most interesting about our three Bengal cats.  They can eat like horses and yet are rather picky about what foods they will eat.  They all like tuna, ham, and even beg for a potato chip from time to time, yet they don't seem to care for turkey and even some types of cheese.  My family and I love our cats very much, and we are concerned about their health and want to feed them nutritious food.  Since all of our Bengals love chicken, I was delighted to recently have the opportunity to try the new Petite Cuisine Chinese Chicken and Chicken Pot Pie Variety Pack.<br /><br />We received a 24 pack, which includes 6 individual boxes, each containing two 3 oz. cans of Sesame Chicken and two 3 oz. cans of Chicken Pot Pie cat food.  The ingredients for each flavor are as follows:<br /><br />Sesame Chicken Entr&eacute;e:  Chicken, Chicken broth, Carrots, Sesame oil, Soy bean oil, Rice, Tricalcium phosphate, Guar gum, Tapioca starch, Calcium sulfate, Salt, Vitamins & Minerals (Vitamin E, Vitamin A, Vitamin D3, Zinc sulfate, Thaimine mononitrate, Manganese sulfate, Menadione sodium bisulfite complex &lt;source of vitamin K>, Riboflavin, Folic acid, Pyridoxine hydrochloride, Copper amino acid complex, Iron amino acid complex), Carrageenan, Choline chloride, Taurine.<br /><br />Chicken Pot Pie Entr&eacute;e:  Chicken, Chicken broth, Sweet Potato, Carrots, Soy bean oil, Tapioca starch, Tricalcium phosphate, Guar gum, Calcium sulfate, Olive oil, Vitamins & Minerals (Vitamin E, Vitamin A, Vitamin D3, Zinc sulfate, Thaimine mononitrate, Manganese sulfate, Menadione sodium bisulfite complex &lt;source of vitamin K>, Riboflavin, Folic acid, Pyridoxine hydrochloride, Copper amino acid complex, Iron amino acid complex), Carrageenan, Choline chloride, Taurine.<br /><br />As you can see, the ingredients in the two flavors are nearly identical.  One controversial ingredient contained in both flavors is Menadione Sodium Bisulfite, which is a synthetic version of vitamin K.  MSB has been called \"potentially harmful\" by many researchers, and is not allowed in human food.  However, the FDA does not restrict the use of MSB in pet foods, and these pet foods are even able to proudly claim \"Natural\" on the label, even if it contains this un-natural ingredient.  Studies indicate that Menadione Sodium Bisulfite can be toxic in high doses, and the tests indicate that this synthetic vitamin supplement can prove toxic to kidneys, lungs, liver, and mucous membranes.  Since I only use the Petite Cuisine food as a supplement to my cat's regular food, I don't consider the levels of MSB to be high enough to put my animals in any danger.  However, it is up to the owner to determine if they find this risk acceptable or not.  You can find more information about Menadione (Vitamin K3) here:<br /> http://www.dogfoodproject.com/index.php?page=menadione<br /><br />The manufacturer website (http://www.petitecuisine.com) says that \"Petite Cuisine is People Food for Cats.\"  There is no wheat gluten, no grain fillers, and no meat byproducts.  The label on the cans says \"Product of Thailand\", and the website boasts that nothing about this food is sourced from China.  All of the meat and vegetables are steam cooked, and each variety is hand packed into each and every can (according to the manufacturer).<br /><br />We have been feeding the Chicken Pot Pie and Sesame Chicken Petite Cuisine entr&eacute;es to our three Bengal cats for the past several days now.  We dispense one can onto a saucer for all three cats to share, once each day.  One thing my wife and I really like about this food is that it doesn't have an unpleasant odor, like most canned pet foods.  It smells like chicken and gravy, and although neither of us are daring enough to try a taste ourselves, our noses tend to support the claim that this is \"people food for cats.\"  The chicken pot pie entr&eacute;e contains several chunks of white meat chicken, along with small bits of sweet potato and carrots, all swimming in an ocean of gravy (or broth, sauce, or whatever you wish to call it).  The food looks good, but I feel that there is just too much gravy, and it could prove to be messy when serving or during feeding.  The sesame chicken entr&eacute;e contains shredded chicken (not chunks), along with bits of carrots and rice in a far more reasonable amount of gravy.  Both entr&eacute;es look good and smell good, but how do the cats like it?  Well as we observed our cats when we served up the food, here is what we found:<br /><br />Chicken Pot Pie Entr&eacute;e:  Asia, our 3 year old female Bengal, greedily devours the hearty chunks of chicken and veggie bits, but leaves most of the gravy behind.  Neo, our 10 month old male Bengal, also enjoys the chicken and licks up quite a bit of the gravy, but doesn't seem at all interested in the bits of sweet potato and carrots.  Matrix, our 2 year old male Bengal always approaches the food, sniffs at it for several seconds, and ultimately walks away without eating any.  Matrix will take a little taste, every now and then, but isn't interested in eating any quantity of it.<br /><br />Sesame Chicken Entr&eacute;e:  Asia again scarfs down the chicken and veggies, but leaves behind the rice and gravy.  Neo seems to eat a little bit of everything.  Matrix again sniffs at the food but will not eat any of it.<br /><br />So overall we have encountered very mixed results with our three cats.  Of course they are cats, so being somewhat finicky is only natural.  Two of the three seem to really enjoy the Petite Cuisine chicken entr&eacute;es, while the third doesn't care for it at all.  So would we buy this variety of Petite Cuisine in the future?  Well I think we will likely try some of the other varieties first, to see if we can get all three cats to enjoy the food.  Petite Cuisine also makes Yellow Fin Tuna, Red Snapper, Tuna & Sole, Tuna & Shrimp, and New England Crab Cake varieties, which all sound like something our cats would like.  We are going to order the <a href=\"http://www.amazon.com/gp/product/B001BDDTB2\">Petite Cuisine Variety Pack (Yellowfin, Snapper, Tuna & Sole, Tuna & Shrimp) for Cats, 3-Ounce Cans (Pack of 24)</a>, and see how our cats like these varieties. My wife and I both feel that Petite Cuisine produces great quality food, with high quality ingredients, and we will certainly buy more of their products in the future.  I do admit that I wish they didn't use the synthetic Vitamin K supplement (Menadione), simply because so many others have expressed real concern about the potential risks of this ingredient.  Many other manufacturers have removed this ingredient from their products, so maybe PetPlay, Inc. (makers of Petite Cuisine) will omit this synthetic ingredient in the future if enough consumer concern is expressed.  I do recommend the Petite Cuisine chicken varieties of cat food to other cat owners, but do so with a bit of caution due to the inclusion of the controversial Menadione Sodium Bisulfite ingredient.  If Petite Cuisine tastes as good as it looks and smells, then I am sure all but the most finicky cats will enjoy it a great deal."}
