{"Id":"1070","ProductId":"B001QXUTLU","UserId":"AHVASC86C9VPS","ProfileName":"One Tree in the Forest","HelpfulnessNumerator":5,"HelpfulnessDenominator":11,"Score":1,"date":"2012-02-23","Summary":"THIS IS NOT THE PRODUCT THAT I RECEIVED. THE ACTUAL PRODUCT MAY CARRY HEALTH RISKS FOR SOME COMSUMERS..","Text":"I purchased this product because of its name, \"Rumford NATURALS Corn Starch\" (the word \"Naturals\" appears large and clear on the pictured product label). Also, the Amazon description said it was made from \"Non-Genetically Modified Corn\". The label on the product that I ACTUALLY received does NOT say Rumford NATURALS, but it is still MADE WITH Non-Genetically Modified Corn. I say \"made with\" because this product now contains more than ONE ingredient. Its ingredients are: Cornstarch, Calcium Sulfate*, and ONE of the suggested servings (1 Tblsp) contains 15% of the \"Daily Value\" of CALCIUM. That makes this product potentially a good source for dietary calcium supplementation. ON THE OTHER HAND, for persons who must restrict their calcium intake (example, some persons with kidney stones), it can pose a potential problem, even danger. Amazon provides themselves with a nice \"out\" for this. They list the following: Legal Disclaimer: \"Actual product packaging and materials may contain more and different information than what is shown on our website. We recommend that you do not rely solely on the information presented and that you always read labels, warnings, and directions before using or consuming a product.\" BUT, IT IS NOT FAIR FOR AMAZON TO NOT AT LEAST LIST THE CORRECT INGREDIENTS AND PHOTO OF THE PACKAGE SO THAT YOU DO NOT HAVE TO ORDER THE PRODUCT IN ORDER TO \"READ LABELS\" AND FIND OUT WHAT YOU HAVE PURCHASED.<br /><br />I WILL NOT BUY THIS PRODUCT AGAIN:<br /> * because I don't need extra calcium<br /> * because I don't believe that the Calcium Sulfate was added out of interest in the consumer's health<br />  but to make the product cheaper to produce so it can be priced competitively with other brands<br />  and still be touted as having been made from/with Non-Genetically Modified Corn<br /> and just on principal because I can't afford to throw it away and did not want the hassle of returning it.<br /><br />I am very, very displeased with Amazon's incorrect listing of the product, which was brought to their attention when I purchased it in February 2012, and so far nothing has been done.<br /><br />*Although Calcium Sulfate is considered a safe food additive it is basically the same thing as Plaster of Paris. AND, if you use too much of this product (basically the same amount as I had previous used of pure CORN STARCH), the very stiff sediment in the bottom of the cooking container (I make pudding in Pyrex in a microwave and usually stir it only every 30 seconds) will remind you of damp plaster!"}
