{"Id":"18800","ProductId":"B001PO7FIU","UserId":"A1UQBFCERIP7VJ","ProfileName":"Margaret Picky","HelpfulnessNumerator":5,"HelpfulnessDenominator":5,"Score":5,"date":"2012-02-05","Summary":"Excellent quality oil with a delicate color, flavor, and fragrance","Text":"La Tourangelle Avocado Oil has a beautiful pale green color and a wonderful but delicate fragrance and flavor of avocados.  It is not at all bitter.  Avocado oil is pressed from the flesh of the avocado, not the seed.<br /><br />It is especially good drizzled on fresh-baked bread or pizza.  It is nice on a salad although if there are other strong flavors for it to compete with such as balsamic vinegar, onions, or cheese, consider using a less expensive oil with a more competitive flavor such as first-press olive oil and save this for when you can better appreciate its unique sensory qualities.  There is a recipe on the label for a citrus dressing with equal parts of this oil and citrus juice with a little honey, salt, and pepper which complements the flavor of the oil rather than overpowers it as a dressing with vinegar does.<br /><br />Avocado oil also has a medium-high smoke point, higher than that of olive oil, so it is safer to use for cooking on the stove top although there are less expensive oils just as suitable for this purpose.<br /><br />Avocado oil is also an excellent oil for use on the skin and the scent is pleasant enough that I will dab a little on my elbows and knuckles when using it in the kitchen.<br /><br />The oil is packaged in a can to protect it from light and the lid fits tightly, although I have found that it will drip from the spout and collect on top of the can.  Twisting the can at the end of the pour (as with a bottle of wine) helps prevent this.  It can be stored at a reasonable room temperature but it would be better off in the refrigerator in warm climates or instead of over the oven.<br /><br />I purchased my La Tourangelle Avocado Oil at a organic grocery store chain (known for high prices) because other customers have reported that they have received rancid cans from Amazon, probably from sitting in a hot warehouse.  Let's hope Amazon addresses this issue and also provides appropriate packaging to protect the attractive can during shipping as the price is significantly lower here."}
