{"Id":"47840","ProductId":"B004SRH2B6","UserId":"A3EZMN1NFHWECF","ProfileName":"Dorian G. Shreve \"Dorian Grey\"","HelpfulnessNumerator":1,"HelpfulnessDenominator":1,"Score":1,"date":"2011-07-18","Summary":"You couldn't pay me to drink this!","text":"I recently started researching the benefits of drinking coconut water and consuming coconut oil daily because I have been trying to change my lifestyle from one of total nutricious abandon to healthy yet happy.  I absolutely love cooking with coconut oil, adding it to my morning coffee, using it as a skin moisturizer, anything and everything I possibly can use it for, and have been telling all of my friends and family.  I never really liked coconut so it did take a little bit to get used to the coconut taste with the oil.  The coconut water, however, was a little trickier.  I knew it would be very beneficial to hydrate myself with it after a hard workout so this is what I decided to do: I bought the Zico 14-ounce bottle of natural coconut water from my local supermarket and also bought a can of Goya's coconut water with pulp to see which one I would be able to drink.  I tried the Zico first thinking that since it's in a plastic bottle and so much more expensive it would be the natural winner.  I had chilled the coconut water in the fridge all day and when I opened the bottle and poured it into a glass I noticed a funny odor immediately.  After my first taste I was horrified at how terrible it was.  It's hard to describe, kind of plastic(y), bitter, and just nasty!  I've had coconut water/milk straight from a coconut before and it was delightful, Zico's does not taste a THING like that.  I know that this has no added sugar whereas Goya adds a little and Zico is \"supposedly\" pure but from concentrate.  I tried another sip thinking that it would grow on me, but no, not one little bit.  I then decided to open up the Goya, cautiously I tried it and I LOVED the coconut pulp and the taste immediately.  I know everyone has different tastes and I will admit that I was never a coconut lover before, but I figured since I have grown to love coconut oil I would be okay, but again, it may be an acquired taste.  My suggestion would be to try a can/bottle of different brands before you give up on drinking coconut water.  I am so glad that I didn't just buy the Zico because I would have signed off on even trying if I hadn't had the Goya right there to redeem itself."}
