{"Id":"13770","ProductId":"B000BSWIQA","UserId":"A2D1LPEUCTNT8X","ProfileName":"Ali Julia","HelpfulnessNumerator":3,"HelpfulnessDenominator":3,"Score":2,"date":"2011-08-20","Summary":"Very disappointed.  This is  a very sweet jelly with an odd texture","Text":"I love lemon marmalade.  They are hard to find, and in the last few years I could not find any in the stores so I decided to buy this Lemon marmalade without being able to look at it closely.  I am attaching a couple of pictures so you can see the content not just the label.<br /><br />I was looking forward to getting it so much. When the box arrived I opened it and tried the marmalade right away... but it was a huge disappointment.  First, it is no a true marmalade it is a jelly. I am attaching two pictures where you can see maybe a couple of lemon zest strips in the entire 454 gram (16 oz).  Second the jelly is soooo very sweet. There is not enough tartness I expected from a lemon marmalade. Third it had a weird texture, it left what I would describe as an oily feel in my mouth unlike any other jelly I have tried.<br /><br />List of ingredients:<br />Sugar 62g per 100g<br />Glucose-fructose syrup<br />Lemons<br />Gelling Agent: Pectin, Citric Acid<br />Acidity Regulator:Sodium Citrate<br />Flavoring: Lemon Oil<br />Color:Caramel E150C<br /><br /> Price with shipping slightly over $11.<br /><br />I eat a lot of different jams. I like having jam with my tea.  I will not be able to eat this jelly with my tea because I really did not like so many things about it. I will try cooking with it, maybe it will work on a chicken as a sauce.  I am so disappointed!<br /><br />8/22/11 Update<br />Normally I would not comment on a specific seller on a product review, but I think in this case it is relevant.<br />Enclosed with the marmalade was FoodIreland 100% satisfaction guarantee flyer with a contact email.  I contacted them over the weekend letting them know I was disappointed in the product. On Monday I received a notification of a full refund.  So if you like jellies the stellar customer service removes the risk of giving it a try."}
