{"Id":"240070","ProductId":"B001VJ0B0I","UserId":"AJLW1DZSHOVGW","ProfileName":"Elaine Campbell \"Desert Dweller\"","HelpfulnessNumerator":2,"HelpfulnessDenominator":3,"Score":4,"date":"2012-07-26","Summary":"Some good healthy ingredients","text":"I give this pet food A plus for palatability as my five dogs all seem to love the flavor of it. And that's important. I've recently invested in expensive, organic premium pet food for both dogs and cats and have been very disappointed because my pets simply would eat very little of it because it wasn't tasty. How to explain that it's good for them?<br /><br />The pluses of this food: Definitely the vegetable ingredients. I think that dogs need vegetables, not just meat. They include corn (not the most nutritious of vegetables but both animals and birds love it), peas (always highly nutritious) and carrots. The flour ingredients are whole wheat and soy flour, both healthful. The beef is real beef.<br /><br />How much of all of these ingredients? We don't know.<br /><br />Vitamin supplements include Vitamins E, A, B12, D3 and menadane sodium bisulfite, said to be a source of Vitamin K activity. I do know what that means. Hopefully, it is beneficial. Minerals, such as zinc sulfate and manganese, are included as well.<br /><br />The food pieces are not too big and not too small so that one can be comfortable offering them to any size of dog, which I did ranging from a chihuahua to a shepherd-chow mix. It was quite suitable for both, and the in-between size ranges.<br /><br />Minuses: I would prefer the chicken by-product meal be eliminated. It can come from pretty messy stuff and one wonders if it is a filling, for flavor enhancement, or some other unnecessary purpose. It just has a negative ring to it. The other ingredient I'm not completely comfortable with is the food dye, although I did some research on the web and it is not considered to be harmful if not used in big quantities.<br /><br />Yes, this is pretty dog food, pleasing to the human eye. And it comes in six different shapes. I find it fascinating that the package claims the benefit of the shapes is that it makes them seem like real pieces of meat to dogs, suggesting that a single uniform shape would not. I don't know if research has been done on canine recognition of shapes, but that does make some sense in their ancestral memory.<br /><br />All in all, I feel comfortable feeding this original Beneful to my dogs and do enjoy their enjoyment of it and pleasure in it. There is better food, but it is more costly and I don't believe it can be obtained at mainline supermarkets, which means trips to two different stores to shop for groceries. In its price range and thinking of its competition (Iams is the only other grocery store-bought dog food I would consider), I think it is a good offering albeit with the above \"minuses\" to take into consideration.<br /><br />One more word: I love the packaging. No more ripping off the top and searching for some clamp to reseal the package with. The entire top of the package has this slide zipper just as on Ziploc bags. Opens easily and fully. Neat!"}
