{"Id":"344301","ProductId":"B0026KNQSA","UserId":"A3T0OTH5072YRE","ProfileName":"M. Reynard \"kairosdreaming\"","HelpfulnessNumerator":0,"HelpfulnessDenominator":0,"Score":3,"date":"2012-05-18","Summary":"Pop Chips Barbeque Potato Chips","text":"My local store was running a special on these, so I decided to give them a try.  They were ok, but I don't think I'd be getting them again if faced with the choice between these and another brand.  A good flavor was quickly followed up by a bad after-taste.<br /><br />The barbecue on this was the sweet smoky type of barbecue.  And it was good, a very addicting flavor.  The problem was the aftertaste that started a few seconds after the barbecue flavor melted away.  To me it tasted of straight rice flour, which is a very acquired taste and one that I've never been able to acquire.  It didn't help that these chips had the texture of Styrofoam either.  Between that and the rice flour taste I just couldn't enjoy them fully.<br /><br />The ingredients, however, are very good in this chip.  They're made of potato, use sunflower and safflower oils and the seasoning even has everything I can pronounce.  Although I am always suspicious when the designation \"spices\" is used without spelling out what those spices are.  And there was some rice flour in the mix which explains the aftertaste, but it was the last ingredient in the listing, meaning there shouldn't have been too much.  But I could still taste it.<br /><br />.8 oz is 100 calories for these chips, and it's a fair serving of the chips.  Enough for a small snack.  The bag boasts that they are all natural, and they are gluten free.  And there's no preservatives.  Sodium is about 7% of the daily value, which isn't outrageously high either.  All in all, they aren't extremely great for a person on a diet, but they aren't the worst thing you can eat, especially if you want a bag of chips.<br /><br />Maybe with a different flavor if they eliminated the rice flour I could bring myself to eat these again.  But since for now it's still there, I'll be steering clear.<br /><br />Review by M. Reynard 2012"}
