{"Id":"496669","ProductId":"B005HG9ET0","UserId":"A244CRJ2QSVLZ4","ProfileName":"J. B. Hoyos","HelpfulnessNumerator":0,"HelpfulnessDenominator":0,"Score":5,"date":"2012-09-19","Summary":"Keeping One's Body Alkaline is Essential for Good Health.  Drinking Essentia Helps.","text":"After a strenuous workout, one must drink plenty of water in order to replenish the electrolytes that were lost through sweating.  Water with an optimum pH level of 9.5 is better absorbed into one's body.  Most tap water and bottled water has a pH level of 7 or below.  Not only is Essentia enriched with electrolytes but it has an average pH level of 9.5.  Therefore, these electrolytes, which are essential for rehydration after a workout, are more readily absorbed into the body.  Bodybuilders have begun carrying gallon jugs of electrolyte rich water with a pH level of 9.5 to their gyms.  Over a few months, most of them have noticed that they recover quicker from their workouts.<br /><br />  I enjoy using one of the elliptical trainers inside the clubhouse at Holly Point Apartments where I live.  Usually, I drink Glaceau Smart Water [<a href=\"http://www.amazon.com/gp/product/B005T1302A\">Glaceau Smart Water, 33.82-Ounce (Pack of 12)</a>] after each of my workouts.  It tastes very refreshing and hydrates me better than ordinary tap water.  It is called Smart Water because it is rich in electrolytes.  Recently, I received a 1.5 Liter plastic bottle of Essentia 9.5 pH Drinking Water from the Amazon Vine Program.  Essentia is also rich in electrolytes but boasts a pH level of 9.5, which is essential for ensuring that these electrolytes are absorbed by the body.  As far as taste and smell, there is no difference between the Essentia and Glaceau.  (See the photograph that I have posted on the web site for this product.)  Odorless and colorless, both brands are very refreshing.  They readily quench my thirst after thirty minutes on the elliptical.  I've tried other brands of tap water {e.g., Aquafina (<a href=\"http://www.amazon.com/gp/product/B0042YSWLE\">Aquafina Pure Water - 32 / 16.9 fl. Oz.</a>) and Dasani [<a href=\"http://www.amazon.com/gp/product/B004ZY7Y9M\">Dasani Purified Water (02762) 0.5 Liter (Pack of 24)</a>]} and they look and taste no different than my tap water.<br /><br />  Many nutritionists are constantly shouting that good health is obtained by eating fruits and vegetables because they make our bodies more alkaline (higher pH level).  An alkaline body resists disease.  Highly processed foods, junk foods, sugars, and meats cause our bodies to become more acidic (lower pH).  Acidic bodies are prone to disease and illness.  Cancer cells are fueled by foods that are acidic.  It only makes sense that our water is best when its alkaline level has a high pH level such as 9.5.  I've noticed that I feel more energetic after a workout when I drink Essentia 9.5 pH Drinking Water or Glaceau Smart Water in lieu of ordinary tap water that has been flavored with my favorite MIO sweet tea water enhancer [<a href=\"http://www.amazon.com/gp/product/B004E4HUMY\">MIO Sweet Tea, 1.62-Ounce (Pack of 4)</a>].  The MIO probably inhibits the absorption of much needed electrolytes.  Now, I only drink water enhanced with MIO at mealtime.  I continue drinking Essentia or Glaceau during and after my workouts.<br /><br />Joseph B. Hoyos"}
