{"Id":"23140","ProductId":"B004ZIER34","UserId":"A1EX5SK2PD0XLC","ProfileName":"Kenneth Sandberg","HelpfulnessNumerator":0,"HelpfulnessDenominator":0,"Score":4,"date":"2011-07-26","Summary":"Different, gentle, mild flavor","Text":"I'm somewhat ambivalent on this product; you can tell from the get-go that it is quite mild, almost gentle on the taste buds (and almost nonexistent on the olfactory senses). It comes in a 3 ounce foil sealed packet (I got 10 in a set); the coffee is very fine (almost like dark brown sawdust from a 320 grit sandpaper).  I would compare this product to ganocafe classic; the two are similar in texture and flavor (except the ganocafe comes in 1 ounce packets and has no caffeine).  One of my slight problems with this product is it comes with NO DIRECTIONS.  I assume you just measure out what you would usually mix for your coffee and put in your drip coffee machine and process as usual.  However, the ganocafe just mixes directly with hot water (very convenient if you are on the go or whatever); I have the feeling you can do the same with this product (just mix directly with very hot water).  The question is how much product to what quantity of water should the ratio be (ganocafe is one ounce to 6-8 ounces of water).  I guess one of the true tests of coffee is how does it taste (or can you even drink it) when it is cool (not iced, not hot); this coffee is still drinkable even when cool.  If you are looking for a product that will not mess up your stomach, I think this product will do the trick.  (However, as a final plug, ganocafe will also do the same thing; however, ganocafe is expensive, and you have to go through a bunch of hoops to get it--like become a distributor, buy at least 60 dollars a month of the product, etc.--I did for a while, accumulating years worth of the product--since it is in tiny foil sealed packets, it will last for years).  Note the four stars is primarily because I believe the product will do as advertised (the low acid amount) and the taste is acceptable (true connoisseurs of coffee will turn up their noses at this product). UPDATE:  I got sample packets; the \"regular\" item DOES COME WITH BREWING DIRECTIONS.  You also can't brew it directly in a cup (just add hot water will not work without complications.  Their phone connection system was excellent, no automated garbage, quick real live person with answers who actually lives in the U.S.  Oh, ALL coffee has some caffeine, just how much (sorry about my earlier comment). One final thing, there is a cold brew coffee  technique called Toddy Coffee; you just put a pound of coffee in a special plastic container, put in some cold water (first 4 cups, then 5 more), let it sit for 10-12 hours, and drain through the filter at the bottom.  You then heat up water and put whatever amount of this dark liquid in the water (usually two parts water to one part liquid coffee. This cold process coffee is extremely mild, much like puroast, except you have your choice of which coffee you want to use.  The downside is you have to use a full pound of coffee (well, you can halve the recipe), and you don't get that much actual coffee (liquid).  Still, it tastes great."}
