{"Id":"240075","ProductId":"B001VJ0B0I","UserId":"A19XMHRB3G4DIR","ProfileName":"javajunki \"javajunki\"","HelpfulnessNumerator":2,"HelpfulnessDenominator":3,"Score":4,"date":"2012-07-25","Summary":"Dogs Loved This Food! People Like the Convenience but still concerned over quality","text":"We have two rescue dogs both of which had major medical issues when we adopted them. In order to reduce the medical problems, we always try to use the same food as they had been fed in the past so over the years, Pedigree seemed to be the food of choice. We mix/match the flavors but generally stick to dry mixed with canned Pedigree brand.<br /><br />This arrived via home delivery in a box along with two other deliveries (spouses new shoes). While we were busy taking a look a the new shoes, our two dogs immediately started sniffing the box with the bag of food inside. In fact, our little \"bagle\" (beagle/basset mix) decided to stand guard and adopt it as her very own. We went ahead, opened the bag and both noses were immediately sniffing all over the bag. Now, it should be said, our dogs are an itsy bitsy bit spoiled and routinely get their own treats or deliveries so they knew this was for them.<br /><br />We offered a handful and each gulped it down happily. Put a few in a kong toy and they thought it was a great treat. Dinner time and they consumed it in record time. Plain and simple...this is a HUGE hit!<br /><br />Now, from the people perspective, the bag is very sturdy and has a zip lock resealable closure which is super nice and convenient. It doesn't require having to empty into a separate storage container which is especially nice for those that have mutiple dog households and hate having to lug/tug big bags home only to be forced to empty into yet another secure storage area.<br /><br />There seem to be additional vitamins, minerals etc which appears competitive with Pedigree. On the other hand, (knock on wood) Pedigree was one of the very few companies not involved in recent recalls over the past few years which means a lot. I'm not yet sure if we will make a full switch but we will be at least partially adding this to the menu since our dogs absolutely love it however, we absolutel love our dogs and have not fed any Purina brand foods until now. I'd really like to know where the ingredients are coming from (China, USA?) and still feel hesitant to return to a company that caused so much pain and suffering in the past."}
