{"Id":"211861","ProductId":"B000CNB4LE","UserId":"A1WX42M589VAMQ","ProfileName":"Mir","HelpfulnessNumerator":110,"HelpfulnessDenominator":124,"Score":1,"date":"2010-05-17","Summary":"Bummer: My fave packaged coconut water is RUINED!","text":"Note: Please carefully review the NEGATIVE reviews before purchasing, as a Zico sales manager and probably others have been affecting the ratings/reviews/comments here due to original Zico drinkers posting critical reviews about this inferior new product that's nowhere near as good as original Zico. Be forewarned.<br /><br />~I've been drinking Zico for a couple years, getting my fix via amazon subscription. I and my sisters loved this stuff so much, I used to regularly order my shipments EARLY, and multiple cases at that.<br /><br />Well, that's it. They have officially lost me as a customer. After waiting impatiently for them to be back in stock in the natural (I hate the flavored ones), I just got the three cases I ordered.<br /><br />Oh, my goodness. I have three cases of this horror! I can't drink this!<br /><br />I don't know why they had to mess with a successful and deliciously refreshing beverage. I grew up drinking fresh coconut water (my family hails from the Caribbean), so I am well accustomed to the natural and subtle yumminess of coconut water. A chilled Zico used to be as close as I could get to the treat that is sipping from a straw right out of the chilled coconut that's had it's top sliced open for you on the spot (and it gets harder to find that in Metro Miami, but you still can).<br /><br />Now, it's not fit to drink. It smells funny. It tastes strange. The best I can describe it is that it reminds me of a watered-down version of the remainder-milk at the bottom of a bowl of Corn Pops when I was a kid--less sweet, more watery, but like that, with a chemically edge and a stale smell.<br /><br />How messed up is this?<br /><br />I can't believe someone gave this bottled version 5 stars! That's crazy. The OLD Zico deserved 5 stars. Not this. I hope those yoga places stop carrying it and tell Zico to bring back the fresh stuff. This sucks. I guess I better start mixing up these 35 bottles of zombie Zico with pomegranate juice or Acai Splash or something to cover up the taste and still benefit from the electrolytes. Hm.  I suspect there will be an upswing in sales for O.N.E. and VitaCoco and other brands in the old packaging. I've tried both of those (still have some ONE in the fridge from my order while I waited for Zico). Both were inferior to Old Zico. Both are preferable to New Zico.<br /><br />And someone please hand the president of Zico a bottle of this and ask hm if he REALLY thinks this is the taste of the stuff that made so many rabid fans, like I USED TO BE: past tense.<br /><br />Hey, Mr. Zico CEO, give me back my money!!!! You sold me rubbish!<br /><br />Okay, I ranted and got that off my chest. I do think having a recyclable bottle is great. The bottle feels good in the hand and makes it easy to add flavorings for those who prefer that. Easier to carry around. And I strongly suspect that those who are new to coconut water won't realize this has declined in flavor, so it's possible it can sell huge among the new initiates to the health benefits of coconut water.<br /><br />But I still miss old Zico.<br /><br />Note: I'm updating cause I found if I let the bottle sit with the cap off or  pour out into a glass, the funny smell dissipates and it's more drinkable. HTH.<br /><br />Update: Found a great replacement. Ordered Organic coconut water from amazon, brand Nature Factor. It's lovely. Lovely! So, at least I've found a happy replacement. Worth a try for those on the lookout for another tasty coconut water now that Zico sucks. Addendum: Found out that this brand uses very high heat to pasteurize and it may be nutrient compromised. If you mostly care about flavor, this one is great. If you are concerned about high heat, prolonged pasteurization, skip this one. HTH.<br /><br />2nd Update: I received a reply to an email I sent to Zico via their website. I was told that new Zico in the bottle tastes \"just like\" young Thai coconut water. That it's different from Brazilian c.w. and so takes getting used to. Hm. Well, I've had unprocessed/raw young Thai coconut water. I don't recall it making me wanna spit it out. :) Just sayin'.<br /><br />3rd Update: Saw a couple online taste tests that gave props to Amy & Brian, also available here on amazon,  so will be trying that, too, now that I'm coconut water peregrinating. Might be worth a shot to google up coconut water taste tests and see what might suit you if you aren't anti-can. ADDENDUM: Tried it, loved the first batch in the 17.5 oz cans. I emailed the company and it's just CW (not from concentrate) and it's FLASH Pasteurized, so the nutrient count should be comparable to other coconut waters in the tetra paks (though A&B will likely show a higher carb/calorie count due to its sweetness). If you're carb-counting, you may wanna compare. If your main concern is \"natural\" and tasty-sweet, then consider Amy & Brian's. Really nice. Warning: Ordered a second batch in the 10 oz cans, and it tasted odd. Candy-sweet, like candy that melted in water. So, I can no longer recommend this brand due to flavor inconsistencies on that scale. Pity, as my first order was AMAZING. boohoo<br /><br />4th Update: Old Zico from Brazilian coconuts will be back in September. If you liked old Zico, WAIT, don't buy this one. Also, in a letter from the Zico Sales Director to a reviewer here (see discussion for details), the Zico rep said they'd increased sodium in this bottled Asian CW Zico to \"optimize\" hydration benefits. So, it's not just that it's from concentrate, it's \"optimized\" to make it saltier. By optimized, I don't mean they ADDED sodium, but used a mix of coconuts to \"optimize.\" (Note: I know this cause the sales manager of Zico, Sherif P. Bates, replied to a discussion with a clarification, and this comment was posted under his own review post here. See discussion of comments under \"Todd O'Connor\". ) I don't know about y'all, but part of the reason why I like CW is that it's great to keep highish blood pressure normal due to its high Potassium. I do not need--and most Americans don't need--more sodium in their beverages or food. Maybe elite athletes sweating up a storm do, but not the rest of us who just exercise moderately (or not at all). So, there you go: New Zico. More sodium, less flavor.<br /><br />Note about reviews: Do check the reviewer's profile. If a reviewer is five-star (or four-star, even) raving about this product and has only reviews for Zico products and has no verified amazon purchase, find a grain of salt to toy with. That's no guarantee, naturally, but sometimes is a clue to...well, you can guess. (Note: See comments under the review by \"Todd O'Connor\" and under Alio \"Alio\"s review for an explanation of how I learned about ONE fake review and Alio \"Alio\" confirming the fake identity.)"}
