{"Id":"240027","ProductId":"B001VJ0B0I","UserId":"ACJT8MUC0LRF0","ProfileName":"D. Fowler \"Dragonfly77\"","HelpfulnessNumerator":1,"HelpfulnessDenominator":1,"Score":4,"date":"2012-07-27","Summary":"Beneful definitely passed the dog taste-test in this house!","text":"If there is such a thing as a dog taste-test, Purina's Beneful has definitely passed it in this house.  My larger dog, who is part hound, could smell the nuggets right through the Amazon box and bag.  Yes, both of my dogs will eat almost anything, but certain flavors get them more excited.  They barked and continued to beg for little treats.  Indeed, my Brandy has her head lying right next to the bag waiting for a bit more.<br /><br />One thing I especially liked was the QuickZip feature that will enable this food to stay fresh.  I often wonder how any dog food can taste good after staying out in an opened bag for such a long time.  This food is conveniently sealed, but if you are thinking of a container, you might wish to consider the <a href=\"http://www.amazon.com/gp/product/B00186RTWW\">IRIS Airtight Pet Food Storage Container</a>, which comes in an assortment of sizes to suit your needs.<br /><br />Do I like Purina products?  I definitely do as I have one of my dogs on another of theirs.  No dog food is perfect, nor will it suit the needs of every household.  You have to decide for yourself if Beneful meets those needs and the needs of your animal.  I'll just lay out a few things about this food, including serving sizes, so you can tentatively judge if this Beneful might be a food you'd consider.  I have two dogs, each with different needs to think about.  This info is straight-from-Purina ... the taste-test was from my dogs, who love it.<br /><br />INGREDIENTS:<br /><br />Ground yellow corn, chicken by-product meal, corn gluten meal, whole wheat flour, animal fat preserved with mixed-tocopherols (form of Vitamin E), rice flour, beef, soy flour, water, meat and bone meal, propylene glycol, sugar, tricalcium phosphate, phosphoric acid, salt, animal digest, potassium chloride, sorbic acid (a preservative), dried peas, dried carrots, calcium propionate (a preservative), choline chloride, l-Lysine monohydrochloride, Vitamin E supplement, zinc sulfate, red 40, ferrous sulfate, manganese sulfate, niacin, yellow 6, yellow 5, Vitamin A supplement, blue 2, calcium carbonate, copper sulfate, Vitamin B-12 supplement, brewers dried yeast, calcium pantothenate, thiamine mononitrate, garlic oil, pyridoxine hydrochloride, riboflavin supplement, Vitamin D-3 supplement, menadione sodium bisulfite complex (source of Vitamin K activity), calcium iodate, folic acid, biotin, sodium selenite.<br /><br />GUARANTEED ANALYSIS:<br /><br />Calorie Content (Metabolizable Energy, ME)<br /><br />3689kcal/kg  1674kcal/lb  360kcal/cup<br /><br />25.0% Crude Protein (Min)<br />10.0%  Crude Fat (Min)<br />4.0% Crude Fiber (Max)<br />14.0% Moisture (Max)<br />1.4%  Linoleic Acid (Min)<br />1.1%  Calcium<br />175 mg/kg Iron (Fe) (Min)<br />0.2 mg/kg  Selenium (Se) (Min)<br />10,000 lU/kg  Vitamin A (Min)<br />100lU/kg Vitamin E (Min)<br /><br />FEEDING:<br /><br />Adult Dogs<br /><br />3 lbs to 28 lbs -  1/2 to 1-1/4 cups<br /><br />28 lbs to 52 lbs - 1-2/3 to 2-1/2 cups<br /><br />52 lbs to 76 lbs - 3-1/4 to 4 cups<br /><br />76 lbs to 101 lbs - 4 to 5 cups<br /><br />100+ lbs - 5 cups plus 1/3 cup for each 10 lbs of body weight over 100 lbs<br /><br />Do I recommend it?  I can only say for my dogs, but they do love it and are patiently waiting for me to undo that QuickZip for another taste!"}
