{"Id":"367526","ProductId":"B003B3OOPA","UserId":"AJYPAZ3JBHBKD","ProfileName":"Art and Soul \"ACottageArtist\"","HelpfulnessNumerator":4,"HelpfulnessDenominator":4,"Score":5,"date":"2012-02-22","Summary":"Awesome Stuff !!","text":"This was my first time to try coconut oil, other than using the red kind for popcorn. [which works great in a Stir Crazy] I will be repeating what many have said, but just to add my thoughts....I hope Amazon stocks this FOREVER !!  Smells lovely, like coconut, reminds me of the beach. At room temperature, it is solid....and if I have one tiny complaint, it can be a little difficult to spoon out of the jar. I don't want to soften/melt it each time I need a teaspoonful, so I struggle a bit and scoop it out.<br /><br />  On toast or English muffins, you can use it just like butter, but it seems to have a much more pleasant taste, and leaves the bread more crispy, {never soggy like butter can sometimes pool on toast in little patches.} To use making scrambled eggs or an omelet, it's easy to use, just like any oil, and adds no real discernible taste to me. It's great to just take some and rub on your skin, you then smell wonderful, and it soaks right in....leaving your skin smooth and silky. I have dry skin, and using this coconut oil or almond oil is something that has changed my life....tossing out all the \"off the shelf\" lotions that never really helped.<br /><br />  Only time will tell if all the health benefits pan out for me. But I enjoy using this instead of butter, and plan to continue to do so. The price is great here on Amazon, especially on Subscribe and Save. It was delivered quickly, although it was just tossed into a large box, and allowed to roll around in transit, which I thought was strange packaging. But it was undamaged, and still solid, no evidence of leakage in the box.<br /><br />  I highly recommend this to anyone wanting to try healthier oils, and anyone with dry skin. I read online that this can be mixed with garlic oil and Vit. E liquid to make a healing ointment. There is a lot of info online regarding the positives of coconut oil, and Dr. Oz recommends it, for what that is worth to you."}
