{"Id":"9600","ProductId":"B002PO09MS","UserId":"A1EQM5VMBPQZ76","ProfileName":"DutchessofBlackhawk \"DutchessofBlackhawk\"","HelpfulnessNumerator":0,"HelpfulnessDenominator":0,"Score":3,"date":"2012-05-09","Summary":"I really wanted to like this fondant!","Text":"I did a lot of research on this fondant and really wanted to like it however it just didn't work for me. When it arrived it was hard as a rock, but there is a card inside that indicates about 30-50 seconds in the microwave will make it easier to work with. This really did work well. It made it much more pliable and easier to work with. The fondant took color real well and rolled out nicely. It does say \"no shortening or powdered sugar needed\" that's pretty false. If you're coloring it you do need some while needing otherwise it will stick to your hands and your work surface. I DEFINITELY needed powdered sugar while rolling it out. Otherwise it stuck to the silicon mat I use. Also, after coloring and putting it in the microwave it definitely needed some time in the refrigerator before it could be rolled again and placed on the cake. Otherwise it was far too gooey.<br /><br />Finally, the moment of truth arrived, laying the rolled out fondant on the cake. It was much more difficult to work with than I imagined. It's very picky on the thickness. Too thick it's impossible to lay flat, too thin and it would stretch and get holes. I will say it did get some 'elephant skin' during application I was able to smooth it out using a smoothing tool and the final product looked fine. Perhaps I was a little bit rusty, I used to teach a Wilton cake decorating class and have taught fondant decorating for many years but haven't done a cake in the past 5-6 years. I just never remember the wilton brand, which tastes horrible, ever being this hard to work with.<br /><br />The flavor was fine on it's own, but as most fondants, it's incredibly sweet..incredibly. Despite the improved flavor people were still pealing it off the cake and eating the cake and frosting.<br /><br />In the end the cake looked wonderful and people were pleased but not sure I'll be using this brand again."}
