{"Id":"341242","ProductId":"B001RVFEP2","UserId":"ASIMCC20UVK58","ProfileName":"R Shackleford","HelpfulnessNumerator":1,"HelpfulnessDenominator":1,"Score":5,"date":"2010-05-21","Summary":"Great Chips Less Fat","text":"I eat chips almost every day and decided I wanted to find something that tastes as good but is lighter on unnecessary fat than regular types of chips. I bought a case of Popchips BBQ. These are satisfying and taste great. They don't taste exactly like any full fat chip products I've had mainly because they're not greasy at all, but they have a nice BBQ potato chip flavor. These are thick, crunchy, and light. I first bought the .8 oz bags and this serving size is on the small side for me with lunch (would probably be alright for a snack). 3 of the .8 oz bags works for me which of course bumps up the fat intake, but considering the same volume of \"regular\" chips has much more fat it is a significant fat decrease overall which is what I was looking for. I find the 3 ounce bags to be perfect. Even eating all 3 ounces works out to significantly less fat and calories than eating the same volume of other chips. This makes Popchips very satisfying to me, and I have bought many cases through Amazon.<br /><br />Heads up (mid-2011): Unfortunately the price has gone up significantly for these chips through Amazon, causing me to cancel my subscribe & save subscriptions. Popchips have popped up in local stores for significantly less per ounce. I love the convenience of the portioned bags and subscription but it's hard to justify paying double for the same product.<br /><br />The flavors are pretty straight forward but here's my thoughts...<br />Original flavor: Tastes like a plain potato chip minus the grease. Not my favorite flavor, but good for what it is. This flavor would probably be good with some kind of dip.<br />Chedder: Cheddar quickly became tied with BBQ for my favorite. Like BBQ the cheddar flavor is very strong. Great chips.<br />Salt & Pepper: Very strong pepper. To enjoy these you have to really like pepper. I like them, but they're not a favorite.<br />Sea Salt & Vinegar: I'm not a fan of vinegar, but strangely I enjoy this flavor. They're indeed salty with a fairly strong vinegar flavor."}
