{"Id":"344377","ProductId":"B0026KNQSA","UserId":"A28RBR0UMPBUR1","ProfileName":"Kathy Lenehan","HelpfulnessNumerator":0,"HelpfulnessDenominator":0,"Score":4,"date":"2012-02-03","Summary":"Alternative to rice cakes","text":"I'm on a diet and there are times when I just want something crunchy. But I also have high blood pressure so a lot of snacks that I use as a treat are too high-sodium for me. I eat rice cakes with peanut butter or cottage cheese once in a while and I happened to see Popchips on Amazon.com. These <a href=\"http://www.amazon.com/gp/product/B001RVAWY0\">Popchips Original Potato Chips, 0.8-Ounce Single Serve Bags (Pack of 24)</a> were advertised at a special price and all the flavored ones were sold out, so I decided to try the original flavor. After trying my first bag I have a few comments.<br />1. Great service - I ordered them on 1/27, and they were delivered on 2/3, with no damage to the packaging.<br />2. I like the 24-pack that are individual servings because that helps me regulate portion control.<br />3. As a previous reviewer noted they do taste somewhat like Pringles - whether that's good or bad is up to individual tastes.<br />4. The nutritional information isn't terrible: a serving has 100 calories, 3 grams of fat with no cholesterol or saturated/trans fat, and only 160 mg.sodium; Pringles also contains 160 mg of sodium but has 150 calories and 9 grams of fat, as compared to potato chips with an average of 150 calories, 180 mg. sodium, and 10 grams fat, and pretzels with 110 calories, 450 mg sodium, and 1 gram fat.<br />5. They are kind of dry and bland, but are delicious with salsa - I really liked them with Costco's peach mango salsa! I don't have cottage cheese in the house so I couldn't try that. And I think peanut butter wouldn't be good unless something \"wet\" like sugar-free jam or jelly is also added.<br />I just got them so I'm not sure if I'll reorder another box; I think I'm going to next order Amazon's 6-flavor variety pack (4 Original Potato, 4 BBQ, 4 Salt & Pepper, 4 Sea Salt & Vinegar, 4 Sour Cream & Onion, 4 Cheddar)before deciding. I would give them 3 stars if my review was just based on taste; I'm giving 4 stars because I really want to like them because they're more healthy and I can think of lots of healthy foods to use them with - why not tuna,, egg salad, etc?"}
