{"Id":"240067","ProductId":"B001VJ0B0I","UserId":"A3JPFWKS83R49V","ProfileName":"Bryan Carey \"Bryan Carey\"","HelpfulnessNumerator":2,"HelpfulnessDenominator":3,"Score":3,"date":"2012-08-09","Summary":"Beneful Dog Food Has its Share of the Good, and the Bad","text":"Beneful is an inexpensive dog food from Purina, one of the original and best- known names in pet food. This particular Purina product is a little different from most in that it contains different colors and shapes of kibbles along with vegetables for a supposedly better- balanced diet.<br /><br />Beneful is an easy to find dog food sold in most stores, including both pet foods and grocery stores/supermarkets. Its widely available status and low price make it an easily recognizable and popular  product and its re-sealable bag is very convenient. It keeps the food inside and undesirable things out, so that the dog food remains fresh and edible for a long time.<br /><br />Name recognition, popularity, low price, nice packaging- these are all good extras, but what about the dog food itself? Well, it seems to be hit and miss with this product. The level of protein isn't too bad and the level of fat is kept under control, but the ingredient list is cause for concern. The first four ingredients are ground yellow corn, chicken by-product meal, corn gluten meal, and whole wheat flour. These are not the ingredients you want to see at the top of a list for your dog's primary source of nutrition. Dogs need meat- not meat by products but real, quality meat- and the best quality dog foods have meat listed first.<br /><br />Some of the other ingredients are equally questionable. The dried peas and carrots are fine, but look at all of those artificial colors. Yes, it does make the food look pretty when poured into a bowl, but this is more for human appeal- a dog really doesn't care about seeing varied hues in its food. A dog just wants something that tastes good while you, the owner, want something with quality and good nutrition.<br /><br />Speaking of the taste, Beneful does score points in this area and that might be a good part of the reason why so many dog owners buy this for their canine friends. Dogs really love this food, and my dog is no exception. He will finish off a large bowl without even pausing and he seems anxious for more.<br /><br />So, how do I rate Beneful dog food overall? Well, I find it has both good points and bad points. It worst quality is the ingredients, but then again, when I look at the ingredients of other dog foods in the same price range, what I see on the Beneful label isn't all that bad. Dogs love the taste, and the nutritional aspects are okay. Thus, when all factors are considered, Beneful rates average overall. It can't compare to the high- quality dog food brands sold in many pet stores, but it has enough good points to recommend it-- barely."}
