{"Id":"240021","ProductId":"B001VJ0B0I","UserId":"A1VBDMNT6I8RE5","ProfileName":"Katharena M. Eiermann \"Existential Diva -- Pr...","HelpfulnessNumerator":1,"HelpfulnessDenominator":1,"Score":5,"date":"2012-07-31","Summary":"...sat up and begged for more. :)","text":"PURINA Beneful Original Dog Food, 15.5-Pound<br /><br />Some dog I got too. We call him Egypt. Because in every room he leaves a pyramid. --Rodney Dangerfield  :)<br /><br />If the Dog Food is a brand I have built up a trust in, claims to be 100% complete and balanced nutrition with wholesome grains and real beef, accented with vitamin-rich vegetables, comes in an easy to carry bag with a zip lock top, into my Shopping Cart it goes!<br /><br />As I am not about to taste the food ( myself ), My dogs ( Rottweilers ) will tell me the rest:<br /><br />Opened up Beneful Original Dog Food, and let my Guys have an initial sniff. (I've learned this is very important -- if mine just sit there, they will probably not eat it).  Their eyes really lit up and you could tell they were getting excited about trying something new and different.<br /><br />The dog food does have a lot of nice colors and shapes - to stimulate their minds - , and has a very pleasant aroma.  Nothing annoying to the senses, as far as I could tell.<br /><br />They waited for the \"cue\" to eat, and then dove in and woofed all the Purina Beneful Original Dog Food down, then hunted around the bowl for any possible spilled nuggets.  I knew it was a hit when they sat up and begged for more. Bravo!  *claps hands*<br /><br />Guess they love it, and Purina is a brand I can trust! 'nuf said!<br /><br />When feeding time is over, there is a large zip lock sort of thing that actually works, to help seal the bag -- keeping the flavor in, the Beneful Original Dog Food fresher and my Guys out of the feed bag. :)<br /><br />Does this sound like what you may be looking for in a dog food? :) I'm off to buy more Purina Beneful Original Dog Food, as this 15 pound bag will not last long, if ya know what I mean!  Highly Recommended!  --Katharena Eiermann, 2012"}
