{"Id":"1120","ProductId":"B0028SWACS","UserId":"ADLVFFE4VBT8","ProfileName":"A. Dent \"Aragorn\"","HelpfulnessNumerator":"4","HelpfulnessDenominator":"4","Score":"3","date":"2011-05-05","Summary":"Quality white tea with added unusual flavors","Text":"Just in case, if anyone doesn't know what WHITE tea is, as opposed to green or black, let's quote Wikipedia: \"white tea is fast-dried, while green tea is roasted in an oven or pan (while kept moving for even curing). Oolong and black teas are fermented before curing.\" What does it mean? For me, it translates into my favorite beverage to start the day with and to keep me going through the day. Objectively and scientifically speaking, white tea is said to have more anti-oxidants and less caffeine so, in my view, it's overall better than coffee or the black or green varieties.<br /><br />This particular product, while it comes in tea bags, it's not exactly your 'supermarket' variety. Unlike the cheap teas, black, green, herbal or white that are delivered crushed inside paper bags, the 'Choice' brand is delivered in pyramid shaped, biodegradable, nylon-like bags that ensure that what you get is actual leaves, not some indistinct crushed powder.<br /><br />This being a white tea, 'delicate' and 'subtle' and the required adjectives to use but they may not apply in this case. I found the added flowers to be a little too strong, bordering to overpowering for my taste. The Lychee and Osmanthus aromas can be an acquired taste - think of sweet, green apples for an equivalent more familiar aroma. If it's not 'love at the first sip', give it some time and you may not only tolerate it but prefer it to other flavors. Or not.<br /><br />INGREDIENTS:<br /><br />- organic, fair trade certified White Tea<br />- natural Lychee flavor<br />- organic Osmanthus flavor<br />- contains caffeine<br /><br />The somewhat off-balance added flavors and the premium price are not likely to turn me into a repeat customer. Time will tell but at this time 3 stars (meaning 'it's Okay') seem to be the fair rating."}
