{"Id":"496681","ProductId":"B005HG9ET0","UserId":"A2YPB8IOEU10XJ","ProfileName":"crazyoaks \"crazyoaks\"","HelpfulnessNumerator":0,"HelpfulnessDenominator":0,"Score":3,"date":"2012-09-17","Summary":"It is water.....","text":"Other than orange juice in the morning I pretty much don't drink anything except water.  I received a 1.5 liter bottle to try of this purified water.  I think \"purified\" in the name says something.<br />The bottle says that they have \"proprietary technology\" which has purified the water by reverse osmosis then infused it with electrolytes for taste, alkalized and restructured it using ionic separation technology.  Okay, we will take their word for it, but none of that sounds any different from any other reverse osmosis to me and adding the \"electrolytes\" is what changes the pH of the water to make it alkalized and restructured, if I remember my chemistry correctly.  The ingredients are listed as purified water, sodium bicarbonate dipotassium phosphate magnesium sulfate and calcium chloride.  The bottle never gives a source but you can find Bothell WA, so most likely it comes from the public water supply there.<br /><br />More bottle information - Doctor recommended to protect improve and enhance the quality of your health.  Silky smooth taste, infused with electrolytes for a difference you can taste 9.5 pH.  I have been told by my doctor to drink at least 2 liters of water daily.  I am a distance walker and live in a hot dry area of the country so any outside work or exercise requires a replacement of fluids and most likely electrolytes.  I don't like sports drinks.  So water with electrolytes is perfect for me.<br /><br />This water did taste good.  It was smooth.  I am just not sure that I want to drink water from a public water source when I can get water from a spring, drop in an electrolyte tablet and have the same thing.  So while I can't argue with any of the claims made on the bottle, I am not convinced enough that this is a \"can't live without it\" purchase."}
