{"Id":"16860","ProductId":"B001LGGH40","UserId":"A1X9OJN30EBE3M","ProfileName":"Dr. Karl O. Edwards","HelpfulnessNumerator":1,"HelpfulnessDenominator":3,"Score":1,"date":"2009-03-19","Summary":"At 135 Calories Per 8 Ounces, This Was Not What I Was Hoping For","Text":"UPDATE: April 3, 2009<br />I \"ordered\" this drink through the Vine program based upon the description (see below). I was hoping that it would be what it claimed: \"A HEALTHY ALTERNATIVE.\" Upon getting this drink I realized that it was actually a fruit juice product, which as such cannot be \"healthy.\" Fruit juice consumption is one of the larger contributing/leading causes of weight gain. Therefore the following review is an exposition of why I, along with the dietitians and nurses that I work with at the Veterans Administration, have rated this a one star product.<br /><br />As an avid diet soda drinker who consumes at least 100 ounces per day, I am always looking for alternatives.  Sadly, Switch is anything but that.  Switch is little more than Shasta (TM) non-caffeinated sodas, but with a few more calories!  The \"diet\" drink I was hoping it would be, turned out to be nothing short of \"off the diet.\"  As far as I am concerned, Switch is a \"wolf in lamb's clothing\" for those who consider themselves \"heath conscious.\"<br /><br />The description, which is rhetoric at its best, states:<br /><br />\"The Switch is a great tasting HEALTHY ALTERNATIVE [emphasis added] to soda. The Switch is 100% juice that is carbonated and contains 100% of DV [Daily Value--not Recommended Daily Amount--based on a 2000 calorie diet] of Vitamin C. It has no sugar added and contains nothing artificial. Its just juice, bubbles and Vitamin C. You'll love The Switch because it has the bold taste and nutritional value of a FORTIFIED [emphasis added] juice, with the carbonated refreshment of a soda.  The Switch is 100% of what you want in a soda, and 0% of what you don't[.]\"<br /><br />Here is what the label actually provides--again, based upon what they call Daily Value (DV), similar to regular sodas:<br />Serving Size: 8.3 fl oz (245 ml)<br />Servings [per can]: 1<br />Total Fat: 0g  0% DV<br />Sodium: 15mg  1% DV<br />Total Carb: 34g  11% DV<br /> SUGAR [emphasis added]: 33g<br />Protein: 0g  0% DV<br /><br />Then separately listed:<br />Vitamin C: 100%<br /><br />There is no direct indication of the amount of Vitamin C, nor is there any direct indication that the Vitamin C--contrary to their description--is not added; just as the sodium is added.  Since it is listed separately, and other sodas indicate they are NOT a source of Vitamin C, I must conclude that the Vitamin C does not come from the juice, but is added.<br /><br />Relative to the regular soda that I am currently drinking (I grabbed the wrong bottle), Coca-Cola Cherry (TR), Switch Black Cherry has 6g more carbohydrates (listed as \"Carb\" above), but 10mg more sodium--although both amounts are listed as 1% of the Daily Value--than 8oz of the Coca-Cola Cherry (TR) soda pop.<br /><br />As for actual ingredients, here is a comparison of Switch Black Cherry and Coca-Cola Cherry (TR):<br />Switch: 100% JUICE (FILTERED SPARKLING WATER SUFFICIENT TO RECONSTITUTE JUICE CONCENTRATES, APPLE, GRAPE, KIWI, ACEROLA, RASPBERRY AND STRAWBERRY JUICE CONCENTRATES), NATURAL FLAVORS, ASCORBIC ACID (VITAMIN C).<br /><br />Coca-Cola (TR): CARBONATED WATER, HIGH FRUCTOSE CORN SYRUP, CARMEL COLOR, PHOSPHORIC ACID, NATURAL FLAVORS, CAFFEINE [23 mg/8 fl oz].<br /><br />Given that acerola is high in Vitamin C, and used in baby foods, I am unsure why ascorbic acid is added to the Switch.  Phosphoric acid is added to soda and other foods to acidify them; that is, to give them a tangy or sour taste--which is derived from the fruit in Switch--at a lower cost that extracting it from fruit.  The carbohydrates in the Switch drink are primarily from the juice, while the corn syrup provides all the carbohydrates in the Coca-Cola (TR).  So, in the end, the only real inexpedience difference in the source of carbohydrates; excluding the added caffeine to this particular soda.<br /><br />That leaves taste.  And to be honest, I prefer sugar substituted soft drinks--and was hoping that Switch would be a way to avoid using sugar substitutes, since some poorly done research suggests that sugar substitutes lead to people consuming more calories (a whole different story, but one I was hoping that Switch would help with).  That said, I must agree with other reviewers that I found the drink to be overly sweet, as did the four other people with whom I shared this drink.  Indeed, I would compare Switch Kiwi with Crystal Light or Sam's Choice with sugar substitute made with too little Club Soda.<br /><br />But drinking Switch MAY BE COOL!?"}
