{"Id":"74766","ProductId":"B0026RQTGE","UserId":"A1UM2Y9A9TCJXU","ProfileName":"Michael Sena","HelpfulnessNumerator":0,"HelpfulnessDenominator":0,"Score":3,"date":"2012-07-29","Summary":"Just Okay, nothing else","text":"Updates: One Day, One Week, Two Weeks, One Month, Three Months, Six Months<br /><br />One Day<br />-------<br />Ordered these yesterday and they came in today, even with Prime two-day shipping - Thanks Amazon!  I gave one to my dachshund, a short-haired 25-lb ball of energy, and he loved it.  He's 10 years old and had typical dog breath.  I'm hoping that giving these to him will not only make his breath less stinky, but also (and more importantly) help out with his teeth.  Whenever he yawns or opens his mouth wide, I can see some plaque on his rear teeth.  The vet hasn't said anything bad about that when I've brought it up, but he no longer rips on his rope toys like he used to.  Sure, some of his loss of love for tug of war can be attributed to age, but I think maybe his teeth are a bit weaker too.  I'll update this according to the schedule I laid out at the very top and let you know what happens.  I've also seen lots of reviews online (not about this product, but about dog- and pet-food in general) being made out of sub par or even unhealthy materials.  I'll let you know if my dog's behavior or overall health changes as well.<br /><br />One Week<br />-------<br />My dog is still loving these things.  I feed him in the morning so I like to think these are an evening snack for him.  I don't know what exactly the dental chews are made from, but I'm able to bend the little green toothbrush-shaped chews into a \"U\" and they don't seem to break.  Perhaps it's some kind of gel or gummy chew?  His breath seems a little less \"heavy\".  His teeth seem to be the same. His behavior hasn't changed either, other than being extremely excited to get a chew at night.  This last bit is important to me, because I know some dog treats can be more like dog-crack!<br />See you in a week!<br /><br />Eventually<br />--------<br />Sorry I didn't keep up to my schedule - I think these things work, though not as well as I'd hoped.  My dog still has lots of plaque and buildup on his rear teeth and more disturbingly these things have caused my dog to frequently urinate in my house.  I suspect they are making him drink a lot of water which he can't hold in.  I walk him three times a day and put him outside two to three more times so there's no issue on my end.<br />My ultimate conclusion is that these are just OK.  They aren't damaging to my dog's health... but to say they were helpful in improving his dental situation would be giving these too much credit.<br />My S&S shipments have been cancelled and I'm out looking for a better product."}
