{"Id":"344311","ProductId":"B0026KNQSA","UserId":"A1EE6LQS3OPY6R","ProfileName":"DynomiteWins \"DynomiteWins\"","HelpfulnessNumerator":8,"HelpfulnessDenominator":8,"Score":5,"date":"2012-01-26","Summary":"Sweet Potato Popchip Goodness!","text":"As a kid, I scarfed bags of the Calbee Sweet Potato chips that my mom would pick up at the local Asian market. As my tastes refined in adulthood, I was less inclined to buy bags of those chips that resembled styrofoam even if I still craved their sugary sweet and salty flavor.<br /><br />These Popchips Sweet Potato chips are the adult version of the snack I grew up with. There's a delicious sweet and salty mix in every bite.  The chip is light and airy, without resembling a foamy rice cake and the deep orange hue is the color of a perfectly roasted sweet potato.<br /><br />I've purchased a number of sweet potato chips from Amazon in the past (Both the \"Terra\" & \"Food Should Taste Good\" chips) which have all been good, but they didn't play up the sweet and salty combo quite as much as I'd like. The Terra chips are more like simple sliced sweet potatoes, oven dried and turned into chips; the Food Should Taste Good chips are like yummy, sweet potato flavored, salty tortilla chips; and these Pop Chips sweet potato chips are, well... sweet potato pop chips.  If you've never had a pop chip before, the weight of an individual chip probably most resembles Baked Lays - but with a puckered, air-puffed texture.<br /><br />There are 100 calories per bag.  24 bags come nicely packed in a box that you can tear open for a neat display in your pantry.  I've purchased bagged chips online a number of times and have received packages where the chips were thrown into a box which was thrown into an Amazon box for shipping so by the time they got to me, all the chips were broken.  Not so with this packaging, they're tightly packed so the the bags don't shift around much in shipping and the few bags we've already eaten have had no more broken chips than what we'd get from picking up a bag in the store.<br /><br />Happy snacking!"}
