{"Id":"8740","ProductId":"B000LKZ84C","UserId":"AKYYV4PLEJRJJ","ProfileName":"SmarterThanYouThink","HelpfulnessNumerator":"27","HelpfulnessDenominator":"29","Score":"4","date":"2008-07-09","Summary":"Great shelf life, very good for general use","Text":"I use this product frequently.  Like most tofu, you need to press it (between paper towels with a heavy skillet on top works fine) to get the excess water out.  The more water you can remove, the less you'll have to deal with sloppiness when cooking, something the previous reviewer did not like.<br /><br />As for a blank slate on taste, that's exactly what makes tofu great.  It will take on any flavor you want to impart.  Our most common marinade is placing the pressed, cubed tofu in a Ziploc with a mix of soy, honey, and lemon or lime juice.  A quick search online for a marinade will give you ideas (many also include minced garlic, ginger, etc).  You can also purchase a premade marinade, like a teriyaki sauce.  The more liquid the marinade (and the more water removed from pressing), the better it will penetrate the tofu.  Even a half hour in the bag works fine.<br /><br />We saute it right in the pan with the stir fry veggies (add tofu last--it just needs to get warm; or, for a firmer style, you can bake or \"brown\" it separately first) and pour in the remaining marinade as the final sauce (you can thicken with cornstarch if desired).  Handle the tofu cubes gently as they are not firm like most meats, but broken up pieces taste just fine too.<br /><br />Marinated tofu cubes also do well on kebabs with veggies on the grill.<br /><br />Plain tofu \"creams\" well and is often good in a dish that requires thickness.  We've made chocolate mousse with it as well as scrambling it like eggs.<br /><br />We have great success breading pressed cubes of this tofu just like you would the chicken in a General Tso recipe.  General Tso's Tofu is AWESOME.  The flavor comes from the sauce so you don't need to marinate first.<br /><br />Some people also freeze tofu--generally remove from packaging and press first--to give it a firmer consistency.<br /><br />Tofu is all about how you prepare it.  Most people will NOT like it plain, so don't expect to just dig a fork into it.<br /><br />This particluar product is great because of its all-purpose nature (firm is definitely better than soft for saute, etc) and its shelf life.  I would have given it five stars but the must-be-refrigerated versions packaged in fluid do seem to be firmer.  They don't last as long in the house, though, so this is a perfect choice to keep in the pantry (usually dated a few to several months out)."}
