{"Id":"11520","ProductId":"B0002UM1AA","UserId":"A3072VKAJZ18X0","ProfileName":"Meglet","HelpfulnessNumerator":1,"HelpfulnessDenominator":2,"Score":4,"date":"2012-05-24","Summary":"Exquisite! An elegant addition to the breakfast table or tea tray","Text":"I am in love with everything rose. I wear rose lotion ( <a href=\"http://www.amazon.com/gp/product/B000087L6T\">Rose Milk Skin Care Lotion - 8 fl oz</a>), I burn rose candles (<a href=\"http://www.amazon.com/gp/product/B00069ZDJS\">Yankee Candle Large 22-Ounce Jar Candle, Fresh Cut Roses</a> and <a href=\"http://www.amazon.com/gp/product/B004OEWDH6\">Votivo Aromatic Candle Rush Of Rose</a>), I use rose lip balm (<a href=\"http://www.amazon.com/gp/product/B0049XKXRY\">Rose Love Balm (Limited Edition) - 15ml/0.5oz</a>) and I drink rose tea (<a href=\"http://www.amazon.com/gp/product/B0017SZTRI\">Teas' Tea Rose Green Unsweetened Tea, 16.9-Ounce Bottles (Pack of 12)</a>.) I seriously surround myself with anything rosy!<br /><br />So when I saw this, *rose preserves*, literally preserves made with real rose petals, I couldn't wait to try it. Oh, the wait was incredible! When it finally arrived I didn't even wait for the toaster, I grabbed a spoon and dug right in!<br /><br />It's delicious. Divine. Extraordinary. It feels absolutely indulgent, eating a jam made of roses. It's so romantic and positively Victorian. There couldn't be a daintier dollop for your scones at tea time.<br /><br />So far I've had rose preserves on waffles, toast, ice cream, fresh fruit & yogurt, and coffee cake. I daresay it would even make a unique sweetener for hot tea.<br /><br />Speaking of sweet, that is my one issue. I find these preserves to be really much sweeter than I generally like; I prefer a bit more tartness, even in jams. Don't get me wrong: it's not overpoweringly sweet, there *is* a definite rose flavor in this, and definitely real petals adding unique flavor and texture. I just wish it weren't quite so sweet. But apparently, according to another reviewer who has tried other brands, Kafkas Rose Preserves are the *least* sugary! Any bit sweeter and it would definitely overpower the delicate rose flavor.<br /><br />So, while I can't give it a full 5 stars because I think it's too sweet -  and by the way I sure wish I could only deduct a half star -  I acknowledge that Kafkas Rose Preserves might be the best available. I certainly won't stop putting it on everything and yes, occasionally enjoying a tiny spoonful!<br /><br />I'm going to host a little tea party for my two little nieces and our American Girls dolls (My <a href=\"http://www.amazon.com/gp/product/B0010XH10I\">American Girl Samantha Doll & Paperback Book</a>, Joelle's <a href=\"http://www.amazon.com/gp/product/B000ZHY3H4\">American Girl Julie Doll and Paperback Book</a>, and Lisey's <a href=\"http://www.amazon.com/gp/product/B001BZYZAO\">American Girl Kit Kittredge Doll & Paperback Book</a>) and I know the girls will get a kick out of eating jam made of flower petals! I'm also looking forward to my extended family's next brunch, because I will be proudly serving up some rose preserves. In fact, I may be giving out Kafkas Rose Preserves as hostess gifts in lieu of the boring bottles of moscato or prosecco I'm forever dragging to parties. This would be promptly opened and enjoyed, I'm sure of it!<br /><br />If you're a rose lover, or looking for a unique gift, perhaps a cute and clever new spin on \"a bouquet of roses and a box of candy\", I highly recommend these rose preserves!"}
